[
    [
        "間",
        "あいだ",
        "・〜間",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜間   】\n\n\n[意味]\n 〜の期間ずっと\n\n[英訳]\n while / during\n\n[接続]\n V（普通形） + 間\n イAい + 間\n ナAな + 間\n Nの + 間\n\n[JLPT レベル]\n N4\n\n[備考]\n 「間」の後ろには継続性のある動作や状態を表す言葉が来る。\n\n\n例文\n・夏休みの間、実家で過ごすつもりです。\n・友達が髪を切っている間、私は雑誌を読んで待ちました。\n・地震で家具や家電が揺れている間は机の下に避難してください。\n・学校にいる間は、携帯電話の使用は禁止です。\n・授業の間は、スマホを使ってはいけません。\n・日本にいる間はなるべく日本語だけを使って生活するつもりです。\n・電車に乗っている間、ずっと英語のCDを聞いています。\n・子供が小さい間は、できるだけ早く帰って妻をサポートするつもりです。\n・友達を待っている間、椅子に座って音楽を聞いていました。\n・校長先生が話している間、しっかりと話を聞きましょう。\n・飛行機に乗っている間、ずっと寝ていました。\n・友達を待っている間、小説を読んでいました。\n・妻が晩ご飯を作っている間、私はずっとスマホでゲームをしていました。\n・留守の間、しばらくうちのペットを預かっていただけないでしょうか。\n \n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/02/jlptn4-grammar-aida/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "間に",
        "あいだに",
        "・〜間に",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜間に   】\n\n\n[意味]\n 〜の期間に・・・する。\n ※ずっと〜するのではない。\n\n[英訳]\n ・・・ take place, while 〜\n\n[接続]\n 普通形 + 間に\n\n[JLPT レベル]\n N4\n\n[備考]\n 「間に」の後ろに継続性のある動詞や表現は使えない。\n●誤用例\n 兄がゲームをしている間に、私は隣でずっと見ていました。\n\n\n例文\n・昨日、寝ている間に地震がありました。\n・娘が出かけている間に晩御飯を作りました。\n・日本に住んでいる間に一度でいいから歌舞伎を見てみたいです。\n・会わない間にずいぶん大きくなりましたね。\n・夏休みの間に富士山に登りたいです。\n・留守の間に友達が訪ねて来たようです。\n・休み時間の間にトイレを済ませておきます。\n・若い間に色々なことにチャレンジするつもりです。\n・暇な間に宿題を終わらせてしまいます。\n・晩ご飯を作っている間に、誰か来ました。\n・夏休みで帰省している間に、泥棒に入られたようだ。\n・学生の間に、一度でいいから海外へ行ってみたい。\n・トムさんと話したり、遊んだりしている間に、彼のことが好きになった。\n・夏休みの間に、一度髪を染めてみようかな。\n・本を読んでいる間に、寝てしまった。\n・生きている間に、一度でいいからヨーロッパへ行ってみたい。\n・昼休み時間の間に、次の授業の予習をしておきます。\n・ちょっと見ない間に、ずいぶん大きくなりましたね。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/04/18/jlptn4-grammar-aidani/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "終わる",
        "おわる",
        "・〜終わる",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜終わる   】\n\n\n[意味]\n 動作の終わりを表す。\n\n[英訳]\n \"finish doing\"\n Indicates the end of an action.\n\n[接続]\n V（ます形）ます + 終わる\n\n[JLPT レベル]\n N4\n\n[備考]\n 自然現象や生理現象には使うことができない。\n 例：雨が降り終わる / 赤ん坊が泣き終わる\n\n\n例文\n今日はもう勉強し終わったので、ゆっくり映画でも見ます。\nI've finished studying today, so I'm going to watch a movie.\nこの本読み終わったんなら借りてもいいよね？\nIf you've finished reading this book, I can borrow it, right?\n作文が書き終わった人から帰ってもいいです。\nThe person who has finished writing the essay can go home first.\nDVDを見終わったので、TSUTAYAに返しに行きます。\nI've finished watching the DVD, so I'm going to return it to TSUTAYA.\n私が話終わってから、質問してください。あとで、質問の時間をとりますから。\nPlease ask questions after I finish talking. I'll give you time for questions later.\nアイロンをかけ終わったら、棚にしまっておいて。\nWhen you finish ironing, please put it away on the shelf.\nパソコンを使い終わったら、電源は切っておいてください。\nWhen you finish using the computer, please turn it off.\n食べ終わったんなら、食器を片ずけなさい。\nIf you've finished eating, please put away the dishes.\n飲み終わったペットボトルはこちらに捨ててください。\nPlease throw away the plastic bottles if you have finished drinking.\n早く問題を解き終わった人は間違いがないかもう一度チェックしてくださいね。\nIf you finish solving questions quickly, please check again if you have mistakes.\n田中さんがこの曲を終わったら、帰りましょう。\nWhen Mr. Tanaka finishes singing this song, let's go home.\n部屋を掃除し終わったし、宿題もやったから遊びに行ってもいいよね？\nI've finished cleaning my room and I've done my homework, so I can go play, right?\nやっと、レポートが書き終わった。\nI've finally finished writing my report.\nハサミを使い終わったら、もとの場所に戻しておいてください。\nWhen you finish using the scissors, please put them back where they belong.\n\n(adsbygoogle = window.adsbygoogle || []).push({});\nこの文型が登場する教科書中級へ行こう　第１課  中級へ行こう 日本語の文型と表現55 第2版 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店教案中級へ行こう　第１課：ファストフード2018.2.24中級へ行こう 第１課「ファストフード」の教案です。学習文型：①N1とえば、N2、②（数量）も、③Nは〜こと、〜ことだ、④V始める・V終わる...\n\n類似文型\n教案中級へ行こう　第１課：ファストフード\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/04/02/jlptn4-grammar-owaru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "がする",
        "がする",
        "・〜がする",
        "vs",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜がする   】\n\n\n[意味]\n 音、声、味、匂い、香り、感じなど感覚を表したいときの言い方。\n\n[英訳]\n \"can hear / see / smell etc (noun).\"\n Used to express the notion that the speaker can perceive a sound, voice, taste, smell, fragrance or feeling.\n\n[接続]\n N + がします\n\n[JLPT レベル]\n N4\n\n\n例文\nどこかでいい匂いがしますね。\nThere's a good smell somewhere.\nキッチンから、カレーの匂いがしてきます。\nI can smell the curry cooking in the kitchen.\nジェシーさんの髪からシャンプーのいい匂いがします。\nI can smell the shampoo from Mr. Jesse's hair.\n隣の部屋から変な音がします。何の音なんでしょう。\nThere's a strange sound coming from the next room. I wonder what it is.\nこのお菓子、コーヒーの味がしますね。\nThis candy tastes like coffee.\nこの飴はりんごの味がします。\nThis candy tastes like apple.\nこの景色を見ていると、なんだか夢のような感じがします。\nWhen I look at this scenery, I feel like I'm in a dream.\n家の外で大きな音がした。\nI heard a loud noise outside my house.\n遠くで、犬の声がしますね。\nI heard a dog's voice at a distance.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/04/12/jlptn4-grammar-gasuru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "かどうか",
        "かどうか",
        "・〜かどうか",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜かどうか   】\n\n\n[意味]\n 間接疑問文。\n 文の中に疑問詞を使っていない疑問文を埋め込んで使う表現。\n\n[接続]\n V（普通形）かどうか、〜\n イA（普通形）かどうか、〜\n ナA（普通形）だかどうか、〜 　 ※ナAだ\n N（普通形）だかどうか、〜　　※Nだ\n\n[JLPT レベル]\n N4\n\n\n例文\n納豆は食べたことがないので、美味しいかどうかわかりません。\nI've never eaten natto before, so I don't know if it's good or not.\n今夜のパーティーに行けるかどうか、まだわかりません。\nI'm not sure if I can go to the party tonight.\n学校を卒業したら国へ帰るかどうか、まだ決めていません。\nI haven't decided yet whether or not I will go back to my country after I graduate from school.\n新しいカバンを買うかどうか、実際に見てから決めます。\nI'll decide whether to buy a new bag or not after I see it in person.\nトムさんに彼女がいるかどうか、聞いてもらえない？\nCan you ask Mr. Tom if he has a girlfriend?\n今年結婚するかどうか、まだわかりませんが、遅くても来年にはする予定です。\nI don't know yet if I'll get married this year, but I'm planning to do it next year latest.\n本当に宇宙人がいるかどうか、誰にもわかりません。\nNo one knows if there really are aliens or not.\nトムさんも参加できるかどうか、聞いてみるね。\nI'll ask Tom if he can join us.\n間違いがないかどうか、もう一度確認してください。\nPlease check again to make sure if there are no mistakes.\nこの文型が登場する教科書みんなの日本語２　第４０課  みんなの日本語 初級II 第2版 本冊 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店げんき２ 第２０課  GENKI: An Integrated Course in Elementary Japanese II [Third Edition] 初級日本語げんき[第3版] IIJapan Times Amazon 楽天市場 Yahooショッピング\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/28/jlptn4-grammar-kadouka/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "かもしれない",
        "かもしれない",
        "・〜かもしれない",
        "adj-i",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜かもしれない   】\n\n\n[意味]\n \n 〜の可能性がある\n \n話し手が推測したことを言う表現。「〜でしょう / だろう」に比べ、判断の根拠が薄く、不確かな推量である。\n\n[英訳]\n \"maybe / perhaps\"\n Indicates that there is a possibility.\n An expression in which the speaker says what he or she guesses. It is an uncertain guess with less basis for judgment than ”〜でしょう / 〜だろう”\n\n[接続]\n V（普通形） + かもしれない\n イA（普通形）+かもしれない\n ナA（普通形）だ + かもしれない\n N（普通形）だ + かもしれない\n\n[JLPT レベル]\n N4\n\n\n例文\n1. 動詞文午後から雨がやむかもしれません。\nThe rain might stop from the afternoon.\n来週、大型の台風が来るかもしれない。\nThere might be a big typhoon next week.\n最近、夫の帰りが遅いし、いい匂いがするし、浮気しているかもしれない。\nMy husband has been coming home late lately, he smells nice, so he might be having an affair.\n今日は仕事がたくさんあるので、飲み会に参加できないかもしれない。\nI have a lot of work to do today, so I might not be able to attend the drinking party.\nピーターさんは薬指に指輪をしているし、結婚しているかもしれない。\nPeter has a ring on his ring finger, he might be married.\n走れば終電に間に合うかもしれません。\nIf I run, I might be able to catch the last train.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/18/jlptn4-grammar-kamoshirenai/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ことがある",
        "ことがある",
        "・〜ことがある",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ことがある / 〜こともある   】\n\n\n[意味]\n いつもではないが、時々〜する\n\n[英訳]\n sometimes do\n\n[接続]\n V（辞書形 / ナイ形）+ ことがある / 〜こともある\n\n[JLPT レベル]\n N4\n\n\n例文\n・大学をしてからも、たまに同じ学部だった友達に会うことがあります。\n・深夜に夫のいびきで、目が覚めることがあります。\n・普段は母がご飯を作りますが、私が作ることもあります。\n・時々、テレビをつけたまま寝てしまうことがあります。\n・私は会議中でも、寝てしまうことがある。\n・山下先輩はとても優しいですが、怒ることもあります。\n・木村部長はとても仕事ができる人ですが、失敗することもあります。\n・一人暮らしをしていると、実家が恋しくなることがある。\n・時々、頭が痛くて寝られないことがあるんですが・・・。\n・プロでもミスをすることがある。\nこの文型が登場する教科書まるごと 日本のことばと文化 初級１ A2 りかい 第１３課  Marugoto: Japanese language and culture Elementary1 A2 Coursebook for communicative language competences \"Rikai\" / まるごと 日本のことばと文化 初級1 A2 りかい (JF Standard coursebook / JF日本語教育スタンダード準拠コースブック) Amazon 楽天市場 Yahooショッピング上級へのとびら 第１課  上級へのとびら ―コンテンツとマルチメディアで学ぶ日本語:TOBIRA Gateway to Advanced Japanese Learning Through Content and Multimedia Amazon 楽天市場 Yahooショッピング 紀伊國屋書店\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/09/jlptn4-grammar-kotogaaru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ことにする",
        "ことにする",
        "・〜ことにする",
        "vs",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ことにする   】\n\n\n[意味]\n \n \"〜すると決める\"\n 自分の意志で〜する、〜しないと決めたことを言う時に使う。\n \n\n[英訳]\n decide to do\n Used to say that you have decided to do or not to do something of your own volition.\n\n[接続]\n V（辞書形 / ナイ形）+ことにする\n \n\n[JLPT レベル]\n N4\n\n[備考]\n ・少し硬い表現に「〜こととする」という表現もある。\n ・自分の意志に関係なく決まったことを言う場合は「〜ことになる」を使う。\n\n\n例文\n・明日から、毎日１０分ジョギングをすることにしました。\n・次の夏休みは国へ帰ることにします。\n・頭が痛いので、今日は早く寝ることにします。\n・日本語学校を卒業したら、国へ帰って働くことにしました。\n・みんなが真面目に勉強しないので、明後日テストをすることにします。\n・浮気ばかりするから、彼とは別れることにしました。\n・自分の会社を作るために、１２月で会社を辞めることにしました。\n・今夜のパーティーには行かないことにしました。\n・何度教えても、覚えてくれないから、ジョンさんにはもう教えないことにしました。\n・健康のために、タバコとお酒をやめることにしました。\n・ダイエットのために、お菓子をやめることにします。\n・わからないことがあったら、まず自分で調べることにします。\n・いくら調べてもわからないので、先生に聞くことにします。\n・大学を卒業後は就職せずに、大学院に行くことにします。\n類似文型【JLPT N4】文法・\n\n例文\n：〜ことになる2019.5.2文型：〜ことになる \"〜することに決まる\" ①自分の意志に関係なく予定や計画が決まることを表す。 ②自分の意志で決めたことを婉曲的に言いたい時にも使う。 something has been decided V（辞書形）+ことになる V（ナイ形）+ことになる N4 ・「〜こととなる」という言い方もあ...\n\n類似文型\n【JLPT N4】文法・例文：〜ことになる\nげんき２ 初級日本語　第２３課\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/04/29/jlptn4-grammar-kotonisuru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ことになる",
        "ことになる",
        "・〜ことになる",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ことになる   】\n\n\n[意味]\n \n \"〜することに決まる\"\n①自分の意志に関係なく予定や計画が決まることを表す。\n ②自分の意志で決めたことを婉曲的に言いたい時にも使う。\n\n[英訳]\n something has been decided\n\n[接続]\n V（辞書形）+ことになる\n V（ナイ形）+ことになる\n\n[JLPT レベル]\n N4\n\n[備考]\n ・「〜こととなる」という言い方もあるが、「〜ことになる」よりも少し硬い。\n ・自分の意志で決めたこと言う場合は「〜ことにする」を使う。\n\n\n例文\n・来月から長期で中国へ出張することになった。\n・システムメンテナンス作業のため年末は出勤することになりました。\n・親から国へ帰ってくるように言われ、来月帰ることになりました。\n・次のプレゼンテーションは私が担当することになった。\n・僕たち、来年の春に結婚することになりました。\n・妻とは話し合いの末、離婚することになった。\n・しばらく、入院することになったので、後はよろしく頼みます。\n・海外転勤が決まったんですが、英語が全く話せなにので、３ヶ月語学研修を受けることになりました。\n・来年から、転勤でタイに住むことになりました。\n・田中さんが休みなので、私が発表することになった。\n・授業中に辞書の代わりとして、スマホを使ってもいいことになった。\n・システムの変更作業で年末出社することになった。\n・多数決の結果、次の生徒会長は僕がすることになった。\n・教授が紹介してくれたおかげで、行きたかったの会社で働けることになった。\n類似文型【JLPT N4】文法・\n\n例文\n：〜ことにする2019.4.29文型：〜ことにする \"〜すると決める\" 自分の意志で〜する、〜しないと決めたことを言う時に使う。 decide to do Used to say that you have decided to do or not to do something of your own volition. V（辞...この文型が登場する教科書４技能でひろがる 中級日本語カルテット１　第２課：メールと手紙  4技能でひろがる 中級日本語 カルテット I Amazon 楽天市場 Yahooショッピング 紀伊國屋書店\n\n類似文型\n【JLPT N4】文法・例文：〜ことにする\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/02/jlptn4-grammar-kotoninaru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "させてください",
        "させてください",
        "・〜させてください",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜させてください   】\n\n[意味]\n 「〜させてほしい」と相手に頼むときに使う表現。\n 相手が許可することを確信して使う場合が多い。\n\n[英訳]\n \"Please let me do\"\n An expression used to ask someone , “Please let me do 〜”\n This is often used with confidence that the other person will allow it.\n\n[接続]\n V（使役形のて形） + ください\n\n[JLPT レベル]\n N4\n\n\n例文\nこの仕事、ぜひ私にやらせてください。\nPlease let me do this job.\nすみません。写真を撮らせてください。\nExcuse me. Please let me take your picture.\nコピーをとらせてください。\nPlease let me make a copy.\nすぐに取りに来ますから、ここに少し荷物を置かせてください。\nI'll be right back to get it, so let me just leave my stuff here.\nすみません。お腹が痛いので、トイレを使わせてください。\nI'm sorry. I have a stomachache, please let me use the restroom.\nもう少し考えさせてください。\nPlease let me think a little more.\n私にもやらせてください。\nPlease let me do it, too.\nちょっと休ませてください。\nPlease let me take a break.\nこの問題は私に答えさせてください。\nPlease let me answer this question.\nすみません。母が倒れたので、今日はもう帰らせてください。\nI'm sorry. My mother collapsed, please let me go home.\n  (adsbygoogle = window.adsbygoogle || []).push({});\n\n\n類似文型\n教案げんき２ 初級日本語　第２２課\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/07/25/jlptn4-grammar-sasetekudasai/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "しか",
        "しか",
        "・〜しか〜ない",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜しか〜ない   】\n\n\n[意味]\n \n 「〜だけ」\n 期待していたよりも程度が低いと感じた時や、量が少ないと感じた時に使う表現。\n\n[英訳]\n \"only\"\n An expression used when you feel that the degree or amount of something is less than you expected.\n\n[接続]\n Noun + しか\n Number + counter + しか\n\n[JLPT レベル]\n N4\n\n[備考]\n 動詞は常に否定の形をとる\n\n\n例文\n・マークさんは日本に３年も留学したのに、ひらがなしか書けません。\n・昨日、忙しすぎて４時間しか寝られませんでした。\n・今、財布の中には５００円しかありません。\n・１,５００円もするのに、これだけしかありません。少なすぎますよ。\n・昨日、３０分しか勉強できませんでした。\n・昨日は彼女と１０分しか電話で話せなかった。\n・夜は野菜しか食べないんです。\n・休みは日曜日しかありません。月曜日から土曜日まで働きます。\n・えっ！断食の時は１日に１食しか食べられないんですか。\n・私の英語は挨拶しかできないレベルです。\n・このお店は予約した人しか入れません。\n・頑張って勉強したのに、テストの結果は３０点しかありませんでした。\n・あー、あと１０分しかないのに、まだ半分以上問題が残っている。\n・シャンプーがもう少ししかないので、明日買ってきて。\n・昨日の試験は３割しかわからなかった。\nA：今夜の飲み会の場所はここから遠いの？\n B：ううん、歩いて１０分しかかからないよ。\nA：え、富士山は夏しか登れないんですか。\n B：そうですね。冬は寒いし危ないですから。それに山小屋も閉まります。\nこの文型が登場する教科書みんなの日本語　第２７課  みんなの日本語 初級II 第2版 本冊 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店げんき２　第１３課  GENKI: An Integrated Course in Elementary Japanese II [Third Edition] 初級日本語げんき[第3版] IIJapan Times Amazon 楽天市場 Yahooショッピング４技能でひろがる 中級日本語カルテット１　第２課：メールと手紙  4技能でひろがる 中級日本語 カルテット I Amazon 楽天市場 Yahooショッピング 紀伊國屋書店まるごと 日本のことばと文化 初級2 A2 りかい 第９課  Marugoto: Japanese language and culture Elementary2 A2 Coursebook for communicative language competences \"Rikai\" / まるごと 日本のことばと文化 初級2 A2 りかい(JF Standard coursebook / JF日本語教育スタンダード準拠コースブック) Amazon 楽天市場 Yahooショッピング\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/15/jlptn4-grammar-shika/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "し",
        "し",
        "・〜し、〜し",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜し、〜し   】\n\n\n[意味]\n \n ①並立描写\n 複数の事柄を並べて述べる表現。話し手の「さらに」、「その上」という気持ちが含まれる。人や物を評価するときによく使われる。\n②理由の列挙\n 理由を複数の上げ、最後に結論を述べる表現。\n 理由を１つだけ言う時もこの文型が使えるが、「言っていないだけで、他にも理由がある」というニュアンがある。\n\n[英訳]\n and besides / because A and B\n\n[接続]\n V（普通形）+ し\n イA（普通形） +　し\n ナA（普通形） +　し\n N（普通形） +　し\n\n[JLPT レベル]\n N4\n\n\n例文\n1. 並列描写・トムさんは、面白いし、親切だし、サッカーも上手です。\n・田中先生は優しいし、かっこいいし、それに教え方も上手です。\n・ジョンさんはスポーツもできるし、頭もいいし、それに女の子からの人気が高いです。\n・大阪は美味しい食べ物がたくさんあるし、観光地がたくさんあるし、それに人が面白いです。\n・スマホがあれば、メールはできるし、電話はできるし、それにゲームもできます。\n2. 理由の列挙・漢字は多いし、文法は難しいし、私は日本語の勉強があまり好きではありません。\n・日本は綺麗だし、食べ物が美味しいし、好きです。\n・このレストランは　安いし　量も多いし、よく来ます。\n・NARUTOも読み終わったし、ドラゴンボールも読み終わったし、何かおすすめの漫画を教えてください。\n・頭も痛いし、熱もあるし、今夜のパーティーには行けません。\n・今日は朝寝坊するし、電車は事故で遅れるし、雨も降るし、最悪な１日だった。\n・日本の電車は時間通りに来るし、たくさんあるし、とても便利です。\n・東京は人が多いし、物価は高いし、住みにくいです。\nこの文型が登場する教科書みんなの日本語　第２８課  みんなの日本語 初級II 第2版 本冊 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店げんき２　第１３課  GENKI: An Integrated Course in Elementary Japanese II [Third Edition] 初級日本語げんき[第3版] IIJapan Times Amazon 楽天市場 Yahooショッピングまるごと 日本のことばと文化 初級2 A2 りかい 第６課  Marugoto: Japanese language and culture Elementary2 A2 Coursebook for communicative language competences \"Rikai\" / まるごと 日本のことばと文化 初級2 A2 りかい(JF Standard coursebook / JF日本語教育スタンダード準拠コースブック) Amazon 楽天市場 Yahooショッピング\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/09/jlptn4-grammar-shi-shi/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "すぎる",
        "すぎる",
        "・〜すぎる",
        "v1",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜すぎる   】\n\n\n[意味]\n 非常に〜だ。\n 程度が水準を超えていることを表す。\n\n[英訳]\n \"too much\"\n Indicates that the degree exceeds the level.\n\n[接続]\n V（ます形）ます + すぎる\n イAい + すぎる\n ナA + すぎる\n\n[備考]\n ネガディブな意味で使われることが多い。\n\n[JLPT レベル]\n N4\n\n\n類似文型\n〜すぎる\n教案【教案】みんなの日本語初級２：第４２課\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/06/jlptn4-grammar-sugiru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "する",
        "する",
        "・（形容詞）する",
        "vs",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：（形容詞）する   】\n\n\n[意味]\n 対象をある状態に変化させることを表す文型\n\n[英訳]\n make it 形容詞\n\n[接続]\n イAく +　する\n ナAに +　する\n\n[JLPT レベル]\n N4\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/23/jlptn4-grammar-adjective-suru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "そうです",
        "そうです",
        "・〜そうです（伝聞)",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜そうです（伝聞）   】\n\n\n[意味]\n \n 見たり、聞いた情報を他の人に伝えるときに使われる表現。\n \n\n[英訳]\n \"I heard\"\n Expressions used to convey information you have seen or heard from others.\n\n[接続]\n 普通形 + そうです\n\n[JLPT レベル]\n N4\n\n\n類似文型\n【JLPT N３】文法・例文：〜とのことだ\n【JLPT N３】文法・例文：ということだ <伝聞・結論>\n【JLPT N２】文法・例文：〜とか（で）\n【教案】みんなの日本語初級２：第４７課\nげんき２ 初級日本語　第１７課\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/02/24/jlptn4-grammar-soudesu/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "出す",
        "だす",
        "・〜出す",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜出す   】\n\n\n[意味]\n ① 動作の開始を表す。\n ② 中や隠れたところから外へ移動することを表す。\n ③ 存在しなかったものを新たに作ったり出現させることを表す（創出・創造）。\n\n[接続]\n V（ます形）ます + 出す\n\n[JLPT レベル]\n N4\n ※N4では意味①のみ扱う。\n[①の意味を表す場合に、よく一緒に使われる単語]\n 突然、急に、いきなり\n\n\n例文\n1. 動作の開始・あ〜、ポテトチップスって食べ出すとどうして止まらないんだろう。\n・突然、雨が降り出して、びしょ濡れになった\n・友達の赤ん坊は私の顔を見ると、突然泣き出した。\n・犯人は警察に気づきどこかに向かって走り出した。\n・みんな揃っていないのに、ジョンさんが突然、食べ出してその場は変な空気になった。\n・フィリピンでコンビニへ行った時、レジの人が突然歌い出してびっくりしました。\n・車を運転している時、突然、子供が飛び出してきて、ひきそうになった。\n・授業中に、ライアンさんが急に隣のアンナさんと話し出したので怒った。\n・急に男の子が飛び出してきて、危うくひきそうになりました。\n・ATMからお金を引き出しました。\n・男はカバンから銃を取り出した。\n・彼の目から涙が溢れ出した。\n・素晴らしいアイデアを生み出すには素晴らしい環境が必要だと思います。\n・今年入った新入社員がバンバン新製品のアイデアを生み出している。\n・この会社は毎年、画期的な商品を作り出している。\n①どちらも動作の開始を表す文型ですが、「〜出す」は意志文では使えない。\n②「出す」のほうが、突然その動作が始まるニュアンスがあり、「始める」は徐々に始まっていくニュアンスがある。\n\n\n類似文型\n【JLPT N4】文法・例文：〜はじめる\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/01/jlptn4-grammar-dasu/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "たばかり",
        "たばかり",
        "・〜たばかり",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜たばかり   】\n\n\n[意味]\n ちょっと前に〜が終わった、〜をした。\n 動作が終わってからの時間が短いことを言いたい時に使う。\n\n[英訳]\n \"have just done\"\n\n[接続]\n V（タ形） + ばかり\n\n[JLPT レベル]\n N4\n\n\n例文\n入社したばかりなのに、毎日とても忙しいです。\nI just joined the company, but I am very busy every day.\n日本に来たばかりなので、まだ日本語は全然わかりません。\nI just came to Japan, so I don't understand Japanese at all yet.\n起きたばかりなので、何も食べたくない。\nI don't want to eat anything because I just woke up.\n転職したばかりなので、まだ仕事の仕方についてわからないことが多い。\nI've just changed jobs, so I still have a lot of questions about how to do my job.\nさっき作ったばかりなので、料理はまだ温かいよ。\nThe food is still warm because I just cooked it a while ago.\n今さっき、食べたばかりなのに、また食べるの。\nI just ate a few minutes ago, and now I'm eating again.\n生まれたばかりの子猫ってかわいいね。\nNewly born kittens are so cute.\nこのパソコン先週買ったばかりなのに、もう壊れたよ。\nI just bought this computer last week, and now it's broken.\n僕は去年、大学院を卒業したばかりです。\nI just graduated from graduate school last year.\n昨日、教えたばかりなのにもう忘れちゃったの？\nI just taught you yesterday, and you've already forgotten?\nパーマをあてたばかりなので、友達に見てもらいたいな。\nI just got a perm, so I want my friends to see it.\nまだ日本に来たばかりなのに、もう国の家族や友達が恋しい。\nI've only just arrived in Japan, but I already miss my family and friends back home.\nA：今日はこの店でご飯食べない？\n B：えー、この前行ったばかりだから違うところにしようよ。\nA: Would you like to have dinner at this restaurant today?\n B: Uhhh, we just went there the other day, so let's go somewhere else.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/04/12/jlptn4-grammar-tabakari/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "たらいいですか",
        "たらいいですか",
        "・〜たらいいですか",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：Vたらいいですか   】\n\n\n[意味]\n 相手に指示を求める時に使う表現。\n「Vたらどうですか」と形が似ているので、注意。\n\n[英訳]\n Used when the speaker seeks instructions from listener\n\n[接続]\n 疑問詞 + V（タ）+ らいいですか。\n\n[JLPT レベル]\n N4\n\n\n例文\n・ホテルの予約をキャンセルしたいんですが、どうしたらいいですか。\n・財布を落としてしまったんですが、どうしたらいいですか。\n・駅まで行きたいんですが、どう行ったらいいですか。\n・先生、いつまでにレポートを出したらいいですか。\n・この本はいつまでに返したらいいですか。\n・もうすぐ、彼女の誕生日なんですが、何を買ったらいいと思いますか。\n・東京スカイツリーへ行きたいんですが、どの駅で降りたらいいですか。\n・来年、韓国へ旅行に行こうと思っているんですが、どこへ行ったらいいですか。\n・Amazonで本を注文したいんですが、どうやったらいですか。\nこの文型が使われている教科書みんなの日本語 初級２　第２６課  みんなの日本語 初級II 第2版 本冊 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店\n\n類似文型\n【教案】みんなの日本語初級２：第２６課\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/06/26/jlptn4-grammar-taraiidesuka/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "たらどうですか",
        "たらどうですか",
        "・〜たらどうですか",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜たらどうですか   】\n\n\n[意味]\n 相手にある行動をするように提案する言い方。\n 「たほうがいい」よりも直接的な提案。\n\n[英訳]\n \"Why don't you ~ / how about if you ~\"\n A way of suggesting that the other person do a certain action.\n A more direct suggestion than \"～たほうがいい\"\n\n[接続]\n V（タ形）+ らどうですか。\n\n[JLPT レベル]\n N4\n\n[備考]\n カジュアルな表現は「〜たら？」や「〜たらどう？」が使われる。\n\n\n例文\nA：最近、体の調子がよくないんです。\n B：そうですか。じゃあ、病院で見てもらったらどうですか。\nA: I haven't been feeling well lately.\n B: I see. Then why don't you go to the hospital for a checkup?\nA：将来、システムエンジニアになりたいと思っているんですが。\n B：じゃあ、大学でコンピューターの勉強をしたらどうですか。\nA: I'd like to be a system engineer in the future.\n B: Then why don't you study computer science at the university?\nA：日本人の彼女が欲しいなぁ。\n B：じゃあ、交流イベントに参加してみたら？\nA: I want to have a Japanese girlfriend.\n B: Then why don't you join a social event?\nA：安い服が欲しいんだけど、どこかいい店知らない？\n B：う〜ん、知らないなぁ。鈴木さんに聞いてみたらどう？\nA: I need some cheap clothes, do you know any good stores?\n B: Hmmm, I don't know. Why don't you ask Mr. Suzuki?\nA：宿題もたくさんあるし、バイトもあるし、全然休む時間がないよ。\n B：そんなに大変なら、バイト減らしたら？\nA: I have a lot of homework and a part-time job, so I don't have time to rest at all.\n B: If it's that hard, why don't you cut back on your part-time job?\nA：今、お金が全然なくてさ。ごめん、貸してくれない？\n B：う〜ん、まずは、親に借りたらどう？\nA: I don't have any money at the moment. I'm sorry, can you lend me some?\n B: Hmmm, Why don't you borrow some from your parents first?\nA：今、昼休みだよ。まだ、仕事してるの？ちょっと休んだら？\n B：うん、ありがとう。でも、これ１時までに作らないといけない資料だから。\nA: We are on our lunch break. Are you still working? Why don't you take a break?\n B: Yeah, thanks. But this is a document that needs to be made by one o'clock.\nA：私の家、ゴキブリが多くて困ってるんです。\n B：じゃあ、一度、家の中をチェックしてもらったらどう？\nA: I have a problem with cockroaches in my house.\n B: Well, why don't you have a contractor check your house?\nA：日本の大学で日本語を勉強したいと思っているんです。\n B：じゃあ、先生に相談してみたらどうですか？\nA: I'd like to study Japanese at a Japanese university.\n B: Well, why don't you talk to your teacher about it?\nA：将来は海外で働きたいないんだけど、どうやったら働けるかな？\n B：知らないよー。先生に相談してみたら？\nA: I'd like to work abroad in the future, how can I do that?\n B: I don't know! Why don't you talk to your teacher about it?\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/06/24/jlptn4-grammar-taradoodesuka/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "続ける",
        "つづける",
        "・〜続ける",
        "v1",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜つづける   】\n\n\n[意味]\n 動作や習慣の継続を表す。\n\n[英訳]\n \"keep on / continue to do\"\n Indicates the continuation of an action or habit.\n\n[接続]\n V（ます形）ます + つづける\n\n[JLPT レベル]\n N4\n\n\n例文\n・母からもらった万年筆を今も使い続けています。\n・私はこの鞄を１０年以上も使い続けています。\n・どんなに大変だったとしても、やり続けることが大切です。\n・努力し続けると、いつかきっと成功するはずです。\n・日本語学校を卒業しても、日本語を勉強し続けるつもりです。\n・私はこの街が大好きですから、結婚してもここに住み続けるつもりです。\n・かなり危ない現場なのに、最後までカメラマンは撮り続けていた\n・スマホの画面を見続けると目によくない。\n・部長は１０分前からずっと話し続けています\n・たくさんの参考書を使って勉強するよりも、１つの参考書を何度も繰り返しやり続けるほうが大切です。\n・１時間以上待ち続けているが、まだ飛行機が来ない。\n・年々、若い人材は減り続けています。\n・商品を置かせて欲しいと、色々な店をまわったが、断られ続けた。\n・どんなに辛くても最後まであきらめずに走り続けます。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/07/10/jlptn4-grammar-tsudukeru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "って",
        "って",
        "・〜って",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜って   】\n\n\n[意味]\n 人や物の名前をいう時に使う表現。\n 話し言葉。「〜っていう」とも言える。\n書き言葉は「〜という」。\n\n[英訳]\n named / called\n\n[接続]\n N + って\n\n[JLPT レベル]\n N4\n\n\n例文\nリュウさん、さっき田中さんって人が探してたよ。\nMr. Ryu, a man named Mr. Tanaka was looking for you earlier.\nこれはたこ焼きっていう食べ物だよ。\nThis food is called takoyaki.\n夏目漱石って人が書いた本を読んだんけど、とても難しくてわからなかった。\nI read a book written by a man named Soseki Natsume, but it was very difficult to understand.\nマルイっていうデパートに行ったことある？\nHave you ever been to a department store called Marui?\nみんなの日本語っていう教科書が一番有名だよね。\nThe most famous textbook is Minna no Nihongo, isn’t it?\nナルトっていう漫画が面白いらしいよ。\nI heard that a manga called Naruto is very interesting.\nanelloっていう鞄が最近、人気があるらしいね。\nI heard that a bag called anello is very popular these days.\nこれはじゃんけんっていうゲームだよ。\nThis is a game called janken(rock, paper, scissors).\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/07/12/jlptn4-grammar-tte/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "て",
        "て",
        "・〜て（理由・原因）",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜て（理由・原因）   】\n\n\n[意味]\n 理由や原因を表す。\n\n[英訳]\n because\n\n[接続]\n V（て形）\n イAくて\n ナAで\n Nで （Nは地震や台風、火事などのよくない単語が来る）\n\n[JLPT レベル]\n N4\n\n[備考]\n 後ろには感情を表す言葉が来ることが多い。\n 後ろに意志を表す動詞は来ない。\n\n\n例文\n1. 動詞文遅れて、ごめん。\nSorry for the delay.\nJLPTに合格できて、本当に嬉しいです。\nI'm really happy to have passed the JLPT.\n今朝のニュースを見て、びっくりしました。\nI was surprised to see the news this morning.\n長い間、家族に会えなくて、寂しいです。\nI'm sad that I haven't seen my family in a long time.\n財布を失くして、困りました。\nI lost my wallet and was in trouble.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/22/jlptn4-grammar-de/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "てある",
        "てある",
        "・〜てある",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜てある   】\n\n\n[意味]\n 誰かが何か目的があってその行為を行い、その行為の結果が残っていることを表す文型。\n\n[英訳]\n somebody has done something intentionally and that state continues.\n\n[接続]\n V（て形） + ある\n\n[JLPT レベル]\n N4\n\n[備考]\n 動詞は他動詞が来る。\n\n\n例文\n・壁にポスターが貼ってあります。\n・テーブルにお皿が並べてあります。\n・もう宿題はしてあります。\n・お風呂はもう沸かしてあります。\n・あ、机の上にケーキが置いてある。\n・もうホテルの予約はしてありますか？\n・昼ごはんは用意してあるから、電子レンジでチンして食べてね。\n・ん？机の上に何かメモが置いてあるなあ。\n・この問題の答えは１２０ページに書いてありますよ。\nA：そろそろ帰りましょうか？\n B:お会計は？\n A：もう払ってありますから、大丈夫です。\nこの文型が登場する教科書みんなの日本語２　第３０課  みんなの日本語 初級II 第2版 本冊 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店げんき２ 第２１課  GENKI: An Integrated Course in Elementary Japanese II [Third Edition] 初級日本語げんき[第3版] IIJapan Times Amazon 楽天市場 Yahooショッピングまるごと 日本のことばと文化 初級2 A2 りかい 第１４課  Marugoto: Japanese language and culture Elementary2 A2 Coursebook for communicative language competences \"Rikai\" / まるごと 日本のことばと文化 初級2 A2 りかい(JF Standard coursebook / JF日本語教育スタンダード準拠コースブック) Amazon 楽天市場 Yahooショッピング\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/02/jlptn4-grammar-tearu/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ていく",
        "ていく",
        "・〜ていく",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜ていく   】\n\n\n[意味]\n ① 今を基準とした、今後の推移や変化を表す。\n ② Vの方向が話し手から離れていくことを表す。\n[英訳]① Used to show, based on the present situation, how things will change in the future.\n ② Used to indicate that the direction of V is away from the speaker.\n[接続]\n V（て形） + いく\n[JLPT レベル]\n N4\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/06/jlptn4-grammar-teiku/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ておく",
        "ておく",
        "・〜ておく",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜ておく   】\n\n\n[意味]\n ① 何かの目的のために、前もって～する（準備）。\n ② 何もしないで、そのままの状態を維持する（放置・現状維持）。\n\n[英訳]\n ① do something in advance\n ② leave something undone\n\n[接続]\n V（て形） + おく\n\n[JLPT レベル]\n N4\n\n[備考]\n 動詞は意志動詞のみ使える\n\n\n例文\n1. 準備・来月、北海道に行くから、ホテルを予約しておきます。\n・来週、パーティーに行くから、髪を切っておきます。\n・後で友達が家に来るから、掃除しておきます。\n・もうすぐJLPTがあるから、習った文法を復習しておきます。\n・雨が降るかもしれないから、傘を持って行っておきます。\n・あとで彼とデートするから、歯を磨いておきます。\n・来週、友達の誕生日パーティーがあるから、プレゼントを買っておきます。\n・明後日、友達の結婚式があるから、スーツを買っておきます。\n・もうすぐ台風が来るかもしれないから、食べ物を用意しておきます。\n・来週、中間試験があるから、単語を復習しておきます。\n・明日、新しい課を勉強するから予習しておきます。\n・明日、プレゼンテーションがあるので、資料をコピーしておきます。\n・もうすぐ映画が始まるので、トイレに行っておきます。\n・夜中に頂上に向けて出発しますので、たくさん休んでおいてください。\n2. 放置・現状維持・先生、ホワイトボードは消さずにそのままにしておいてください。あとで、私が消しますから。\n・プロジェクターは次の会議でも使いますから、そのままにしておいてください。\n・今晩、友達と焼肉食べ放題に行くので、あまり食べないでおこう。\n・エアコンはつけたままにしておいてください。\nA：トム、まだ寝ているね。\n B：アルバイトや勉強で疲れているんでしょう。起こさないでおきましょう。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/09/19/jlptn4-grammar-teoku/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ていただけませんか",
        "ていただけませんか",
        "・〜ていただけませんか",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜ていただけませんか   】\n\n\n[意味]\n 丁寧にお願いする表現\n\n[英訳]\n \"please do something for me.\"\n Used to when you request someone to do something in a polite way.\n\n[接続]\n V（て形） + いただけませんか\n\n[JLPT レベル]\n N4\n\n[備考]\n カジュアルな言い方は「〜てくれない？」\n\n\n例文\n銀行へ行きたいんですが、道を教えていただけませんか。\nI want to go to the bank, could you tell me the way?\nこの漢字の読み方を教えていただけませんか。\nCould you please tell me how to read this kanji?\nすみませんが、お金を貸していただけませんか。\nI'm sorry, but could you lend me some money?\n明日は８時に起こしていただけませんか。\nCould you wake me up at 8:00 tomorrow?\n先生、すみませんが、この単語の意味を教えていただけませんか。\nExcuse me, teacher, could you tell me the meaning of this word?\nすみません。写真を撮っていただけませんか。\nExcuse me, could you take a picture of me?\nシャワーが壊れているようなので、部屋を変えていただけませんか。\nThe shower seems to be broken, could you please change my room?\n消しゴムを忘れたので、貸していただけませんか。\nI forgot my eraser, can I please borrow it?\n先生、推薦状を書いていただけませんか。\nTeacher, could you please write a letter of recommendation for me?\nすぐに戻ってくるので、少しの間、荷物を置かせていただけませんか。\nI'll be back soon, may I please leave my belongings for a while?\nすみませんが、もう一度説明していただけませんか。\nI'm sorry, but could you please explain again?\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/02/jlptn4-grammar-teitadakemasenka/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "てくる",
        "てくる",
        "・〜てくる（行って戻る）",
        "vk",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜てくる（行って戻る）   】\n\n\n[意味]\n 一時的に用事で他の場所へ移動し、用事を済ませ戻って来ることを表す。\n\n[英訳]\n To leave somewhere for temporary time for trivial purpose.\n\n[接続]\n Vて + くる\n\n[JLPT レベル]\n N4\n\n\n例文\n・牛乳が無いですね。ちょっと、コンビニまで買いに行ってきます。\n・ちょっとトイレに行ってきます。\n・あら、スプーンが無いですね。ちょっと取ってきます。\n・ちょっとお腹が空いたので、マクドナルドでポテトを買ってきます。\n・あれ、パクさんがまだですね。ちょっと呼んできます。\n・先生を呼びに行ってきます。\n・あれ、トムさんはまだ来ていませんね。ちょっと探してきます。\n・ちょっと自動販売機でジュースを買ってきます。\n・ゴミがたまったので、捨ててきますね。\nこの文型が登場する教科書みんなの日本語２　初級 第４３課　  みんなの日本語 初級II 第2版 本冊 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店 【教案】みんなの日本語初級２：第４３課2018.1.22みんなの日本語 第43課の教案です。この課では「〜そうです」と「〜て 来ます」の文型を学習します。...できる日本語　初級 第１０課　バスツアー  できる日本語　初級 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店 \n\n類似文型\n【教案】みんなの日本語初級２：第４３課\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/09/18/jlptn4-grammar-tekuru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "でしょう",
        "でしょう",
        "・〜でしょう（確認・同意)",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N5】文法・例文：〜でしょう（確認・同意）   】\n\n\n[意味] 相手に確認したり、同意を求める表現\n\n[英訳]\n \"right\"\n “でしょう？” is used to seek the listener’s confirmation or agreement.\n \n\n[接続]\n V（普通形）+ でしょう\n イA（普通形）+でしょう\n ナA（普通形）\b+ でしょう 　※ナAな + でしょう\n N（普通形） + でしょう　※Nだ + でしょう\n\n[JLPT レベル]\n N5\n\n\n例文\nA：ねぇ、冷蔵庫にあった私のケーキ食べたでしょう？ B：知らないよ。\nA：今、私の話してたでしょう？何話してたの？ B：何も話てないよ。 A：嘘だー。絶対話してたよ。\nA：トムさんは今夜の飲み会に来るでしょう？ B：うん、行くよ。\nA：あれー、私のスマホどこ？ B：机の上にあるでしょう？\nA：今、私のこと見てたでしょう？ B：み、見てないよ！\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/29/jlptn5-grammar-deshou/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN5文法"
    ],
    [
        "てみる",
        "てみる",
        "・〜てみる",
        "v1",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜てみる   】\n\n\n[意味]\n \n いいかどうかわからないので実際に行動して確かめる\n \n\n[英訳]\n try doing something\n\n[接続]\n V（て形）+ みる\n 意志動詞と接続する。\n\n[JLPT レベル]\n N4\n\n\n例文\n似合うかどうかわからないので、履いてみます。\nI don't know if it suits me, so I'll try it on.\nサイズが合うかどうかわからないので、着てみます。\nI don't know if it fits, so I'll try it on.\n美味しいかどうかわからないので、試しに食べてみます。\nI don't know if it tastes good, so I'll try it.\nもしお金がたくさんあったら、何をしてみたいですか。\nIf you had a lot of money, what would you like to do?\n日本に行ったら、相撲を見てみたいです。\nIf I went to Japan, I would like to try watching sumo wrestling.\n一度でいいから海が綺麗な南の島でのんびり過ごしてみたいなぁ。\nI would like to spend a relaxing time on a southern island with a beautiful sea just once.\n京都に行ったら、着物を着てみたいです。\nWhen I go to Kyoto, I want to try on a kimono.\n大人になったら、世界一周旅行をしてみたいです。\nWhen I grow up, I want to try traveling around the world.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/03/22/jlptn4-grammar-temiru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "と",
        "と",
        "・〜と",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜と   】\n\n\n[意味]\n ある動作を行うと、必ず、別のことがらや作用が続いて起こることを表す。\n 機械の使い方や道順の説明によく使われる。\n\n[英訳]\n whenever A happens, B also happens.\n\n[接続]\n V（辞書形 / ナイ形）+ と\n イAい + と\n ナAだ + と\n Nだ + と\n\n[JLPT レベル]\n N4\n\n[備考]\n ・後件に意志を表す文や依頼表現などは使えない。\n ・仮定条件には使うことができない。\n 例：もし１００万円あると、何がしたいですか？\n\n\n例文\n・この道をまっすぐ行くと、病院があります。\n・このまままっすぐ行って、２つ目の角を左に曲がると、交番があります。\n・お金を入れて、食べたい料理のボタンを押すと、食券が出ます。\n・春になると桜が咲きます。\n・冬になると、暗くなるのが早くなります。\n・一日中パソコンを使うと、目が痛くなります。\n・私は彼の顔を見ると、いつも元気になります。\n・私は電気を消さないと、寝られません。\n・このダイアルを回すと、音が大きくなります。\n・このボタンを押すと、ドアが開きます。\n・JLPT N2に受からないと、就職は難しいですね。\n・アレルギーがあるので、猫に触ると体がかゆくなります。\n・成績が悪いと、学校を卒業できませんよ。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/09/03/jlptn4-grammar-to/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ところだ",
        "ところだ",
        "・〜ところだ",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜ところだ   】\n\n\n[意味]\n ① ある動作が始まる直前を表す。これから〜する。\n ② ある動作が今、まさに行われている最中であることを表す。\n ③ ある動作が終わった直後を表す。たった今〜した。\n\n[接続]\n ① V（辞書形）+ところだ。\n ② V（て形）いる + ところだ。\n ③ V（た形）+ ところだ。\n\n[JLPT レベル]\n N4\n\n\n例文\n1. 直前・今から、電車に乗るところです。\n・これから飛行機に乗るところなので、着いたら連絡します。\n・今から、ご飯を食べるところです。\n・今から、会社を出るところだよ。\nA：もう映画始まった？\n B：ううん、今から始まるところだよ。\n2. 最中・今、電車に乗っているところだから、後で電話するね。\n・今、宿題をしているところだから、後で遊ぼう。\n・今、エラーの原因を調べているところなので、もう少し待ってください。\n・今、晩ご飯の準備をしているところだから、もう少し待ってね。\nA：今から遊びに行ってもいい？\n B：ごめん、今部屋を掃除しているところだから、終わってからでいい？_\n3. 直後・今、電車を降りたところなので、あと１０分ぐらいで着きます。\n・ちょうど今、宿題が終わったところなので、一緒に遊べますよ。\n・ちょうど今、ご飯を食べ終わったところで、お腹いっぱいなので動けません。\n・あ、もしもし、ちょうど今、カフェに着いたところだよ。\nA：ごめん、待った？\n B：ううん。私も今着いたところだよ。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/03/jlptn4-grammar-tokoroda/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "という",
        "という",
        "・〜という",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜という   】\n\n\n[意味]\n 聞き手が知らないであろう物・人・場所などの名前を言う時に使う。\n\n[英訳]\n …called / …named\n\n[接続]\n N1 + という + N2\n\n[JLPT レベル]\n N4\n\n[備考]\n ・カジュアルな言い方は「〜っていう」\n\n\n例文\n私はタマという猫を飼っています。\nI have a cat named Tama.\n村上春樹という小説家を知っていますか？\nDo you know a novelist named Haruki Murakami?\n私はインドネシアのバンドンという町から来ました。\nI'm from a town called Bandung in Indonesia.\nママルースというイタリアンレストランが美味しいらしいです。\nI heard that the food in the Italian restaurant called Mama Lou’s is delicious.\n「鬼滅の刃」という漫画が、世界中で人気があるそうです。\nI heard that the manga called “Kimetsu no yaiba” is popular all over the world.\n先ほど、木村さんという方からお電話がありましたよ。\nI just received a phone call from a person named Mr. Kimura.\nまっすぐ行くと、「来来亭」というラーメン屋がありますから、そこを右に曲がると病院があります。\nIf you go straight, you will see a ramen shop called \"Rairaitei\", then turn right and you will find the hospital.\n「十人十色」という言葉を知っていますか。\nHave you ever heard of the phrase “juunin toiro?\n私は日本語を勉強する時、「日本語NET」というサイトを使っています。\nWhen I study Japanese, I use a website called “日本語NET\".\nフィリピンはシニガンという料理が有名らしい。\nI heard that the Philippines is famous for a dish called sinigang.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/02/jlptn4-grammar-toiu/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "なかなか",
        "なかなか",
        "・なかなか〜ない",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：なかなか〜ない   】\n\n\n[意味]\n ① 簡単には〜できない\n ② 〜するには時間がかかる\n\n[英訳]\n not easily\n\n[接続]\n なかなか + V（否定形）\n\n[JLPT レベル]\n N4\n\n\n例文\n・もう来るはずなんですが、なかなかバスが来ませんね。\n・さっきコーヒーを飲んだせいで、なかなか寝られません。\n・タバコをやめたいと思っているんですが、なかなかやめることができません。\n・もう日本に来て１年以上経つのですが、日本語がなかなか上手になりません。\n・毎日ジョンギングをし、食べる量も減らしたのですが、なかなか痩せません。\n・先日潰したニキビの跡がなかなか消えません。\n・一度ポテチを食べ始めると、なかなかやめることができません。\n・薬を飲んで、たくさん寝ているんですが、なかなか熱が下がりません。\n・何度も書いて練習しているんですが、なかなか覚えられません。\n・飲み会の店を探しているんですが、どこも満席でなかなか見つけられません。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/07/28/jlptn4-grammar-nakanaka-nai/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "なさい",
        "なさい",
        "・〜なさい",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜なさい   】\n\n\n[意味]\n 命令・指示を表す。\n\n[英訳]\n do it\n\n[接続]\n V（ます形）ます + なさい\n ex. たべる → たべ(ます) + なさい = たべなさい\n\n[JLPT レベル]\n N4\n\n\n例文\nジェームス、早く起きなさい。\nJames, wake up.\n今何時だと思ってるの！早く寝なさい。\nDo you know what time it is? Go to bed.\n次の質問に答えなさい。\nAnswer the following questions.\nご飯の前に、ちゃんと手を洗いなさい。\nWash your hands before you eat.\nもっと、野菜も食べなさい。\nEat more vegetables.\nよく噛んで食べなさい。\nChew your food well.\nジェームさん、廊下で立っていなさい。\nStand outside in the hallway, James.\nちょっと、どこ行くの。待ちなさい！\nWhere are you going? Wait!\nゲームばかりはダメよ！ちゃんと、勉強もしなさい。\nDon't play video games all the time! Study too.\n部屋が汚すぎよ！掃除しなさい。\nYour room is so dirty! Clean it up.\nしっかり考えてから、言いなさい。\nThink thoroughly before you speak.\nそこ、うるさいよ！静かにしなさい。\nIt's too noisy in there! Be quiet.\n二人とも、喧嘩はやめなさい。\nBoth of you, stop fighting.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/02/jlptn4-grammar-nasai/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "なら",
        "なら",
        "・〜なら",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜なら   】\n\n\n[意味]\n ① 相手が話題にしたことを取り上げて、それに関してアドバイスしたり、リクエストしたりする時に使われる表現\n ② 相手の言ったことを話題に取り上げて述べる表現\n ③ 限定や対照を表す。「他は〜ではないが、ある１つのものや事柄に関して言うと〜だ」という意味。\n\n[接続]\n ① 普通形 + なら\n ② N + なら\n ③ N + なら\n[JL. PT レベル]\n N4\n\n\n例文\n1. アドバイス・リクエストA：今度、韓国へ旅行に行くんですが、お土産に何を買えばいいですか。\n B：韓国ならやっぱり海苔かな。\nA：来週、シンガポールに行くんですが、何を食べればいいですか？\n B：シンガポールなら「チリクラブ」がオススメですよ。\nA：今度、大阪に旅行に行くんだけど、何かオススメある？\n B：初めての大阪なら、大阪城とか、通天閣とかかなあ。それと、大阪のたこ焼きは絶対に食べたほうがいいよ。\nA：将来、日本で働きたいと思っています。\n B：日本で働きたいなら、基本的な日本語はもちろん、きちんと敬語を勉強しておいたほうがいいよ。\nA：ちょっとコンビニへ行ってくる。\n B：コンビニへ行くなら、ついでに牛乳買ってきて。\nA：先輩、リスニングの試験でいい点が取れないんです。\n B：リスニングが苦手なら、シャドーイングの練習をしてみたらどうかな。\n2. 話題に取り上げるA：トムさんはどこ？\n B：トムさんなら、さっきトイレに行ったよ。\nA：すみません。浅草寺はどこですか。\n B：浅草寺なら、この道をまっすぐいったところにありますよ。\nA：何か楽器ができますか。 B：ギターならできますよ。\nA：日本語が話せますか。 B：少しなら話せます。\nA：Bさんはサッカーをしますか。 B：しないですね。でも、野球ならしますよ。\nA：料理ができますか。 B：いいえ、できません。でも、味噌汁ぐらいなら作れますよ。\nA：アルバイトをしたことがありますか。 B：いいえ、ありません。でも、ボランティアならしたことがあります。\nA：ペットを飼ったことがありますか。 B：猫なら飼ったことがありますよ。\nA：海外に行ったことがありますか。 B：中国なら行ったことがありますよ。\nA：Bさんは本を読みますか？ B：漫画なら読みますよ。\nA：明日は時間がありますか。 B：午後から忙しいので、午前なら大丈夫です。\n  (adsbygoogle = window.adsbygoogle || []).push({});\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/04/jlptn4-grammar-nara/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "にくい",
        "にくい",
        "・〜にくい",
        "adj-i",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜にくい   】\n\n\n[意味]\n ①〜するのが難しい\n ②なかなか〜しない（性質）\n\n[英訳]\n difficult to do\n\n[接続]\n V（ます形）ます + にくい\n\n[JLPT レベル]\n N4\n\n\n例文\nこの漢字は覚えにくいです。\nIt's hard to memorize this kanji.\n焼き魚は骨が多くて食べにくいです。\nIt is difficult to eat grilled fish because it has many bones.\n上司は無口で、顔が怖いので話しかけにくいです。\nMy boss doesn't talk much and has a scary face, so it's hard for me to talk to him.\nこの靴はデザインはかっこいいんですが、歩きにくいです。\nThese shoes have a cool design, but they are hard to walk in.\nこんなところでハイヒールは歩きにくいですよ。\nIt's hard to walk in high heels in a place like this.\n今日は曇りなので、洗濯物が乾きにくいです。\nIt's cloudy today, so it's hard to dry the laundry.\nこの本は字が小さくて読みにくいです。\nIt's hard to read this book because the characters are too small.\n田中先生の授業は説明が難しくて、わかりにくいです。\nTeacher Tanaka's lessons are difficult to understand because of his difficult explanations.\nトムさんの話はいつも長くてわかりにくい。\nMr. Tom's talks are always long and difficult to understand.\nこのあたりは、高いビルが多いし、賑やかだし、住みにくそうです。\nThere are a lot of tall buildings in this area, and it is crowded, so it seems difficult to live here.\nこの道は狭くて、車も多いので、運転しにくいです。\nThis road is narrow and there are many cars, so it is difficult to drive.\nこのカバンは安いですが、丈夫で壊れにくいです。\nThis bag is cheap, but it is durable and hard to break.\nこのコップはプラスチック製なので割れにくいです。\nThis cup is made of plastic, so it's hard to break.\nちょっとここでは話しにくいので、場所を変えませんか。\nIt's a little difficult to talk here, so let's transfer to another place.\nちょっと先生には相談しにくいので、トムさん、私の悩みを聞いてくれない？\nIt's a little difficult to talk to the teacher, so can you listen to my problems, Mr. Tom?\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/01/jlptn4-grammar-nikui/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "にする",
        "にする",
        "・〜にする",
        "vs",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜にする   】\n\n\n[意味]\n 色々ある選択肢の中から、１つを選んで決めるときに使う。\n\n[英訳]\n \"decide on\"\n Used to decide on one out of the various options.\n\n[接続]\n N + にする\n\n[JLPT レベル]\n N4\n\n\n例文\n【レストランで】\n A：う〜ん、私はステーキにします。Bさんは？\n B：私はスパゲティにします。\n【In a restaurant】\n A: Hmm, I'll have the steak. How about Mr. B?\n B: I'll have spaghetti. \n【ホテルの受付で】\n A：お部屋はツインベットとダブルベット、どちらになさいますか。\n B：ダブルベッドにします。\n【At the reception desk of the hotel】\n A: Would you like a twin bed or a double bed in your room?\n B: I'll have a double bed.\n【服屋で】\n A：どっちにしようかなあ。こっちはデザインがいいし。でも、こっちはセールで値段が安いし。\n B：欲しいのにしたら？\n A：うん、じゃあデザインがかっこいいのにする。\n【At a clothing store】\n A: I wonder which one I should choose. This one has a better design, but this one is on sale and has a lower price.\n B: Why don't you get the one you want?\n A: Yeah, I'll go with the one with the cool design.\n【授業中止の案内】\n 大型の台風が近づいてきているので、今日は休みにします。\n【Class Cancellation Notice】\n A big typhoon is approaching, so we're going to cancel today.\n【予定を決める】\n A：来週の土曜日、USJに行かない？\n B：いいね、行こう！\n A：やったー。じゃあ、待ち合わせ場所はどこにする？\n B：１０時に大阪駅はどう？\n A：オッケー。\n【Decide on the schedule】\n A: Next Saturday, why don't we go to USJ?\n B: Sounds good, let's go!\n A: Yay! Then, where do you want to meet?\n B: How about Osaka Station at 10:00?\n A: Ok.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/29/jlptn4-grammar-nisuru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ので",
        "ので",
        "・〜ので",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ので   】\n\n\n[意味]\n 理由・原因を言う時に使う。\n\n[英訳]\n because\n Used to say the reason or cause.\n \"ので\" sounds more formal than \"から\"\n \n\n[接続]\n 普通形 + ので\n\n[JLPT レベル]\n N4\n\n[備考]\n 「から」よりも少しフォーマルな文型。\n 命令文や禁止文などでは「ので」よりも「から」を使うことが多い。\n\n\n例文\n暑いので、エアコンをつけてもいいですか。\nIt's hot, so can I turn on the air conditioner?\n電車が遅れたので、少し遅刻しそうです。\nThe train is late, so I'm going to be a little late.\n頭が痛いので、帰ってもいいですか。\nI have a headache, can I go home?\n熱があるので、今日は学校を休みます。\nI have a fever, so I'm going to miss school today.\nお腹が痛いので、トイレに行ってもいいですか。\nI have a stomachache, can I go to the restroom?\n仕事が終わったので、そろそろ家に帰ります。\nI've finished my work, so I will go home soon.\n私はベジタリアンなので、肉は食べません。\nI'm a vegetarian, so I don't eat meat.\n来週、国から家族が来るので、アルバイトを休ませていただけませんか。\nMy family will come from overseas next week, so can I take a break from my part-time job?\n床が滑りやすくなっているので、気をつけてください。\nThe floor is slippery, so please be careful.\nこの本、面白いので、ぜひ読んでみてください。\nThis book is very interesting, so please read it.\n来月、友達の結婚式があるので、国へ帰ります。\nI'm going back to my country next month because it’s my  friend's wedding.\n人がいっぱいなので、別のお店へ行きましょう。\nThere are too many people, so let's go to another store.\n疲れたので、ちょっと休ませてください。\nI'm tired, please let me rest.\n本を読んでいるので、静かにしてください。\nI'm reading a book, so please be quiet.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/01/jlptn4-grammar-node/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "のは",
        "のは",
        "〜のは〜だ",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜のは〜だ   】\n\n\n[意味]\n 強調構文。\n 後件の内容を強く言いたい時に使う表現。この文型を使うことで、文全体の主張が強まる\n\n[英訳]\n It is 〜 that 〜. / The reason 〜 is because 〜\n (Used to focus on the latter part of the sentence.)\n\n[接続]\n V(普通形) +　のは\n N + なのは\n イA + のは\n ナAな + のは\n(事実) +のは + (説明、理由、強調したいこと) です。\n\n[JLPT レベル]\n N4\n\n\n例文\n・地震が起きた時、一番大切なのは慌てないことだ。\n・日本語を勉強するとき、一番難しいのは漢字だ。\n・問題なのは物価が高いことだ。\n・山田さんが家へ来たのは、先週の火曜日です。\n・私が住んでいるのは、大阪です。京都じゃありません。\n・働いているのは、お金のためはなく、自分のスキルアップのためだ。\n・アルバイトをしているのは、旅行をするためです。\n・試合に負けたのは、練習が足りなかったからです。\n・この店で一番人気があるのは、ハンバーグだ。\nこの文型が登場する教科書みんなの日本語２　第３８課  みんなの日本語 初級II 第2版 本冊 Amazon 楽天市場 Yahooショッピング 紀伊國屋書店まるごと 日本のことばと文化 初級2 A2 りかい 第３課  Marugoto: Japanese language and culture Elementary2 A2 Coursebook for communicative language competences \"Rikai\" / まるごと 日本のことばと文化 初級2 A2 りかい(JF Standard coursebook / JF日本語教育スタンダード準拠コースブック) Amazon 楽天市場 Yahooショッピング\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/04/10/jlptn4-grammar-nowa-desu/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "が",
        "が",
        "・〜は〜が、〜は（対比）",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜は〜が、〜は（対比）   】\n\n\n[意味]\n ２つの物や事柄を対比して言う時に助詞「は」が使われる。\n\n[JLPT レベル]\n N4\n\n\n例文\n・日本に来たときは寂しかったですが、今は友達もできて楽しくなりました。\n・日本語の会話練習は好きですが、漢字の練習は嫌いです。\n・トムさんにはバレンタインのチョコをあげたけど、ジェームスさんにはあげなかった。\n・日本に来てから京都へは行きましたが、東京へはまだ行っていません。\n・時給は安いですが、この仕事は楽しいです。\n・英語ははわかりますが、中国語はわかりません。\n・犬は好きですが、猫はあまり好きじゃありません。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/09/06/jlptn4-grammar-wa-ga-wa/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ばかり",
        "ばかり",
        "・〜ばかり",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N４】文法・例文：〜ばかり   】\n\n\n[意味]\n 同じ物がたくさんある、同じことを何度もするという意味を表す。 マイナスの意味で使われることが多い。\n\n[接続]\n V（て形） + ばかり\n N + ばかり\n\n[JLPT レベル]\n N4\n\n\n例文\n1. Vてばかり・友達はいつもゲームしてばかりいる。\n・田中さんはいつも仕事中に寝てばかりいます。\n・私の父は休みの日にいつも、テレビを見てばかりいます。\n・食べてばかりいると、太りますよ。\n・遊んでばかりいないで、勉強もしなさい。\n・毎日お酒を飲んでばかりいると、いつか体を壊しますよ。\n・座ってばかりなので、お尻が痛いです。\n・山田先生はいつも怒ってばかりで、授業が楽しくない。\n2. Nばかり・この会社の社員は若い女性ばかりだ 。\n・友達は旅行中、セルフィーばかりしていました。\n・トムさんは文句ばかりで、全然宿題をしてこない。\n・一人暮らしの息子は、ファストフードやインスタント食品ばかり食べているので少し心配です。\n・彼はいつも嘘ばかりついているから信用されていない。\n・ここ数日、雨ばかりね。\n・甘い物ばかり食べていると、虫歯になるよ。\n・ファストフードばかり食べていると、病気になるよ。\n・最近、失敗ばかりで本当に嫌になるよ。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/11/27/jlptn4-grammar-bakari/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "はずだ",
        "はずだ",
        "・〜はずだ",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜はずだ   】\n\n\n[意味]\n 理由があって、絶対に〜だと思う。\n\n[英訳]\n must / be supposed to be the case\n\n[接続]\n V（普通形）+ はずだ\n イA（普通形）+ はずだ\n ナA（普通形） + はずだ　※ ナAな + はずだ / ナAである + はずだ\n N（普通形）+はずだ　※ Nの + はずだ / Nである + はずだ\n\n[JLPT レベル]\n N4\n\n[備考]\n 過去の計画について述べる時は「〜はずだった」\n\n\n例文\n高いし、人が多いし、このレストランの料理は美味しいはずです。\nIt's expensive and crowded, so the food in this restaurant must be good.\n今日は日曜日だから、銀行は閉まっているはずだ。\nIt's Sunday, so the banks must be closed.\n田中さんは東京大学を卒業したから、頭がいいはずです。\nMr. Tanaka graduated from Tokyo University, so he must be very smart.\nトムさんは２０年も日本に住んでいるから、日本が上手なはずです。\nTom has lived in Japan for 20 years, so he must be good at Japanese.\n彼はお金持ちですから、車をたくさん持っているはずです。\nHe's rich, so he must have a lot of cars.\n佐藤さんはお酒が嫌いだといっていましたから 、ビールを飲まないはずです。\nMr. Sato said he doesn't like to drink alcohol, so he must not drink beer.\n黒田さんは毎日ジョギングをしていますから、 ジョギングが好きなはずです。\nMr. Kuroda jogs every day, so he must like jogging.\n山田さんは毎日買い物していますから、お金がたくさんあるはずです。\nYamada does shopping every day, so she must have a lot of money.\n太郎くんは１７歳ですから、お酒を飲まないはずです。\nTaro is 17 years old, so he shouldn't drink alcohol.\nリーさんと１時間前に電話したから、そろそろ着くはずです。\nI called Mr. Lee an hour ago, so he should be there soon.\nトムさんなら、JLPT N1に絶対合格できるはずだ。\nI'm sure Tom can pass the JLPT N1.\nちゃんと考えた？マークさんなら答えはわかるはずだよ。\nHave you thought this through? I'm sure Mark will know the answer.\n確か、田中さんは帰国子女だから、英語がペラペラなはずですよ。\nI'm sure Tanaka-san is a returnee, so he should be fluent in English.\n確か、ジェシカさんは抹茶のチョコレートが好きなはずだから、お土産はこれにしよう。\nI'm sure Jessica likes green tea chocolates, so I'll bring her some as souvenirs.\n昨日、面接を受けるはずだったが、台風のせいで延期になってしまった。\nI was supposed to have an interview yesterday, but it was postponed because of the typhoon.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/10/01/jlptn4-grammar-hazuda/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "始める",
        "はじめる",
        "・〜始める",
        "v1",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜はじめる   】\n\n\n[意味]\n 動作や現象の開始を表す。\n\n[英訳]\n \"start to / begin to\"\n Indicates the beginning of an action or phenomenon.\n\n[接続]\n V（ます形）ます + 始める\n\n[JLPT レベル]\n N4\n\n\n例文\n来週から英会話教室に通い始めます。\nI'm going to start taking English conversation classes next week.\nまだ、みんな揃ってないですが、先に食べ始めましょう。\nWe're not all here yet, but let's start eating first.\nチャイムが鳴って、学生が椅子に座り始めた。\nThe chime rang, and the students began to sit on their chairs.\n日本に住み始めたばかりなので、わからないことがたくさんある。\nI've just started living in Japan, so there are many things I don't understand.\n先週から犬を飼い始めた。\nI started to have a dog last week.\n春が来て、桜が咲き始めました。\nSpring has come and the cherry blossoms have started to bloom.\n秋が来て、葉が赤くなり始めました。\nAutumn has come, and the leaves have started to turn red.\n健康のために、サプリメントを飲み始めました。\nI started taking supplements for my health.\n雨が降り始めたので、急いで帰ることにしました。\nIt started to rain, so I decided to hurry home.\n先週から、この会社で働き始めました。\nI started working at this company last week.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/03/25/jlptn4-grammar-hajimeru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "必要がある",
        "ひつようがある",
        "・〜必要がある",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜必要がある   】\n\n\n[意味]\n 〜しなければならない\n ある目標や目的を達成するためには、〜しなければならないという意味。\n\n[英訳]\n \"It is necessary to / need to do\"\n This sentence pattern is used to indicate that the necessity of doing something.\n\n[接続]\n V（辞書形）+ 必要がある\n\n[JLPT レベル]\n N4\n\n\n例文\n図書館の本を借りるには、図書カードを作る必要がある。\nIn order to borrow books from the library, you need to make a library card.\n本当にJLPTに合格したいなら、ジョンさんはもっと勉強する必要がありますよ。\nJohn, If you really want to pass the JLPT, you need to study harder.\n会議室を使いたい場合は、予約しておく必要がある。\nIf you want to use a meeting room, you need to reserve it.\n海外で働くには、その国でワーキングビザを取る必要がある。\nIf you want to work abroad, you need to get a working visa in that country.\n海外旅行をする前に、パスポートを作る必要があります。\nWe need to get a passport before we travel abroad.\n進路については、もっと話し合う必要がありそうだ。\nI think we need to talk more about your future course.\n日本の会社で働くために、JLPT N3に合格する必要がある。\nI need to pass the JLPT N3 in order to work for a Japanese company.\n御社の製品を採用するかどうかは、もう少し社内で検討する必要がある。\nWe need to discuss more internally whether or not to adopt your products.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/02/24/jlptn4-grammar-hitsuyougaaru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ほうがいい",
        "ほうがいい",
        "・〜ほうがいい",
        "adj-i",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文型・例文：〜ほうがいい   】\n\n\n[意味]\n \n 〜すること（しないこと）を、相手に助言する表現。\n そうしなかったら悪いことが起こると助言や忠告をするときに使う。\n\n[英訳]\n \"had better\"\n Express an advice or recommendation.\n Used to advise or giving warning that something bad will happen if you don't.\n\n[接続]\n V（た形） + ほうがいい\n V（ナイ形） + ほうがいい\n\n[JLPT レベル]\n N4\n\n\n例文\n・疲れているとき、早く寝たほうがいいよ。\n・大切な試験の日は早く家を出たほうがいい。\n・健康のために、できるだけ運動したほうがいい。\n・肉だけじゃなく、野菜も食べたほうがいいですよ。\n・毎日、少しずつ単語を覚えたほうがいいよ。\n・君はもっと勉強したほうがいいよ。\n・熱があるから、今日はゆっくり休んだほうがいいよ。\n・習ったことは、その日のうちに復習したほうがいいよ。\n・悪いことをしたら、素直に謝ったほうがいいよ。\n・ここらへんは滑りやすいから、気をつけたほうがいいよ。\n・いくら考えてもわからないなら、先生に相談したほうがいいよ。\n・これはちょっとグロテスクな映画なので、苦手なら見ないほうがいいよ\n・今日は雨が降るらしいから、傘を持っていったほうがいいよ。\n・そっちは危ないから行かないほうがいいよ。\n・そのプリン、たぶん賞味期限が切れてるから食べないほうがいいよ。\n・タバコは吸いすぎないほうがいいよ。\n・無理をしないほうがいいですよ。\n・あまり冷たいものは飲まないほうがいいですよ。\n・水で冷やしたほうがいいですよ。\n・ここで、その話はしないほうがいいよ。\n・その椅子は汚れているから、座らないほうがいいよ。\n・部屋を掃除したほうがいいですよ。\n文型イラスト〜たほうがいい / 〜ないほうがいい2020.7.31日本語の初級文型「〜たほうがいい / 〜ないほうがいい」の導入や練習に役立つ絵カードです。 １０枚１2０円で販売します。 購入はnoteでできます。 「〜たほうがいい / 〜ないほうがいい」の絵カードを購入する...類似文型【JLPT N4】文法・\n\n例文\n：〜たらどうですか2018.6.24文型：〜たらどうですか 相手にある行動をするように提案する言い方。 「たほうがいい」よりも直接的な提案。 \"Why don't you ~ / how about if you ~\" A way of suggesting that the other person do a certain act...\n\n類似文型\n〜たほうがいい / 〜ないほうがいい\n【JLPT N4】文法・例文：〜たらどうですか\n【教案】みんなの日本語初級２：第３２課\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/04/19/jlptn4-grammar-hougaii/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "まだ",
        "まだ",
        "・まだ〜ていない",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：まだ〜ていない   】\n\n\n[意味]\n 動作やイベントが終わっていないことを表す（未完了）。\n\n[英訳]\n \"not yet\"\n Indicates that the action or event has not been completed.\n\n[接続]\n まだ + V（テ形） + いません\n\n[JLPT レベル]\n N4\n\n[備考]\n ① 話し言葉では、「Vていない」が「Vてない」になる。\n ② 質問に「いいえ」で返答する時は「いいえ、まだです。」と言い方もある。\n\n\n例文\nあ〜、まだ国へ帰るチケットを買ってない。\nOh, I haven't bought a ticket back to my country yet.\nまだ明日締め切りのレポートが終わってないので、遊びに行けない。\nI still haven't finished the report that's due tomorrow, so I can't go out to hang out.\nA：遅れてごめん。もう、試合始まった？\n B：ううん、まだ始まってないよ。\nA: Sorry for the delay. Has the game started yet?\n B: No, it hasn't started.\nA：トムさんは来ましたか？\n B：いいえ、まだ来ていません。ちょっと電話してみましょうか。\nA: Has Mr. Tom arrived yet?\n B: No, he hasn't arrived yet. Shall I call him.\nA：もう夏休みの宿題終わった？\n B：ううん、まだ終わってない。\nA: Have you finished your summer homework yet?\n B: No, I haven't finished it.\nA：みなさんはどこの大学を受験するか決めましたか？\n B：いいえ、まだ決めていません。\nA: Have you decided which university you're going to apply for?\n B: No, I haven't decided yet.\nA：もう昼ごはん食べた？\n B：ううん、まだ食べてない。\nA: Have you eaten lunch yet?\n B: No, I haven't eaten.\nA：昨日、教えた単語はもう覚えましたか。\n B：いいえ、まだ覚えていません。\nA: Have you memorized the words I taught you yesterday?\n B: No, I haven't memorized them yet.\nA：ごめん、寝てた？\n B：ううん。まだ寝てないよ。どうしたの？\nA: Sorry, were you asleep?\n B: No. I'm not asleep. What's wrong?\nA：最近、公開された「ジョーカー」もう見た？\n B：ううん、まだ見てないよ。\n A：じゃ、一緒に見ない？\n B：うん、いいよ。\nA: Have you seen \"The Joker\" that came out recently?\n B: No, I haven't seen it yet.\n A: Well, do you want to watch it with me?\n B: Yes, that's fine.\nA：みなさん、Lesson15の単語はもう覚えましたか？\n B：いいえ、まだ覚えてません。\nA: Have you memorized the words for Lesson 15 yet?\n B: No, I haven't memorized them yet.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/27/jlptn2-grammar-mada-teinai/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ていない",
        "ていない",
        "・まだ〜ていない",
        "adj-i",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：まだ〜ていない   】\n\n\n[意味]\n 動作やイベントが終わっていないことを表す（未完了）。\n\n[英訳]\n \"not yet\"\n Indicates that the action or event has not been completed.\n\n[接続]\n まだ + V（テ形） + いません\n\n[JLPT レベル]\n N4\n\n[備考]\n ① 話し言葉では、「Vていない」が「Vてない」になる。\n ② 質問に「いいえ」で返答する時は「いいえ、まだです。」と言い方もある。\n\n\n例文\nあ〜、まだ国へ帰るチケットを買ってない。\nOh, I haven't bought a ticket back to my country yet.\nまだ明日締め切りのレポートが終わってないので、遊びに行けない。\nI still haven't finished the report that's due tomorrow, so I can't go out to hang out.\nA：遅れてごめん。もう、試合始まった？\n B：ううん、まだ始まってないよ。\nA: Sorry for the delay. Has the game started yet?\n B: No, it hasn't started.\nA：トムさんは来ましたか？\n B：いいえ、まだ来ていません。ちょっと電話してみましょうか。\nA: Has Mr. Tom arrived yet?\n B: No, he hasn't arrived yet. Shall I call him.\nA：もう夏休みの宿題終わった？\n B：ううん、まだ終わってない。\nA: Have you finished your summer homework yet?\n B: No, I haven't finished it.\nA：みなさんはどこの大学を受験するか決めましたか？\n B：いいえ、まだ決めていません。\nA: Have you decided which university you're going to apply for?\n B: No, I haven't decided yet.\nA：もう昼ごはん食べた？\n B：ううん、まだ食べてない。\nA: Have you eaten lunch yet?\n B: No, I haven't eaten.\nA：昨日、教えた単語はもう覚えましたか。\n B：いいえ、まだ覚えていません。\nA: Have you memorized the words I taught you yesterday?\n B: No, I haven't memorized them yet.\nA：ごめん、寝てた？\n B：ううん。まだ寝てないよ。どうしたの？\nA: Sorry, were you asleep?\n B: No. I'm not asleep. What's wrong?\nA：最近、公開された「ジョーカー」もう見た？\n B：ううん、まだ見てないよ。\n A：じゃ、一緒に見ない？\n B：うん、いいよ。\nA: Have you seen \"The Joker\" that came out recently?\n B: No, I haven't seen it yet.\n A: Well, do you want to watch it with me?\n B: Yes, that's fine.\nA：みなさん、Lesson15の単語はもう覚えましたか？\n B：いいえ、まだ覚えてません。\nA: Have you memorized the words for Lesson 15 yet?\n B: No, I haven't memorized them yet.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/27/jlptn2-grammar-mada-teinai/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "までに",
        "までに",
        "・〜までに",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜までに   】\n\n\n[意味]\n その時間や日付が来る前に\n\n[英訳]\n “までに” indicates “time limit”.\n Used when talking about doing something within a given time period.\n\n[接続]\n V（辞書形）+ までに\n N（時間 / 日付）+ までに\n\n[JLPT レベル]\n N4\n\n\n例文\nレポートは来週の水曜日までに出してください。\nPlease submit the report by next Wednesday.\n死ぬまでに１度はアフリカへ行ってみたいです。\nI want to go to Africa at least once before I die.\n月末までに、きちんと家賃を払ってくださいね。\nPlease make sure you pay your rent by the end of the month.\n今日の５時までに、終わらせてください。\nPlease finish it by 5 o'clock today.\n参加したい人は、明日までに連絡ください。\nIf you want to participate, please contact me by tomorrow.\nイベントは朝９時からスタートしますから、８時までに学校に来てください。\nThe event starts at 9:00 a.m., so please be at the school by 8:00 a.m.\n３０歳になるまでに結婚したいです。\nI want to get married before I turn 30.\nトムさんの分はないので、彼が来るまでに食べてしまってください。\nWe don't have enough for Tom, so please eat up before he gets here.\nこの本、１５日までに返してくださいね。\nPlease return this book by the 15th.\n部長が出張から戻ってくるまでに、なんとかこの資料を完成させなければ。\nI have to finish this document before the director comes back from his business trip.\n大学を卒業するまでに、なんとか仕事を見つけたい。\nI want to find a job before I graduate from college.\n日が暮れるまでに帰らないと、怒らちゃう。\nI'll be scolded if I'm not home by sundown.\nシンデレラは夜１２時までに帰らないと魔法が解けるということで慌てて帰りました。\nCinderella was in a hurry to go home because the spell would be broken if she didn't get home by midnight.\n  シンデレラ (ディズニー プレミアム・コレクション) Amazon 楽天市場 Yahooショッピング\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/24/jlptn4-grammar-madeni/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "まま",
        "まま",
        "・〜まま",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜まま   】\n\n\n[意味]\n 同じ状態が変わらずに続くことを表す。\n\n[英訳]\n while ~ (Used to show the same situation continues.)\n\n[接続]\n V（タ形 / ナイ形） + まま\n イAい + まま\n ナAな + まま\n Nの + まま\n\n[JLPT レベル]\n N4\n\n\n例文\n1. 動詞文・昨日は電気をつけたまま寝てしまった。\n・どうぞ、靴を履いたままでお上がりください。\n・友達に本を借りたまま、まだ返していません。\n・見て、ジョンさん、目を開けたまま寝てる。\n・息子は朝、家を出たまま、まだ帰ってこない。\n・私の妻は１０年前も今も綺麗なままだ。\n・この街は昔と変わらず不便なままだ。\n・これは生のままでも食べられますか。\n・田中さんの顔は１０年前のまま変わっていません。\n・着替えるのが面倒だったので、パジャマのままコンビニへ行った。\n・この街は昔のまま、何も変わってないなあ。\n・スリッパのままでけっこうですよ。\n「Vたまま」は瞬間動詞と一緒に使われる。 （例）立ったまま、食べる。 /  死んだまま、動かない。/ 電気をつけたまま、寝る。\n\n\n類似文型\n〜まま\n中級へ行こう　第６課：日本人の発明\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/24/jlptn4-grammar-mama/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "みたいだ",
        "みたいだ",
        "・〜みたいだ（推量）",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜みたいだ（推量）   】\n\n\n[意味]\n \n \"〜と思う / 〜の感じがする\"\n 五感を使って話し手が感じたこと、推量したことを言う表現\n \n\n[英訳]\n It seems like\n\n[接続]\n V（普通形） + みたいだ\n イA（普通形）+ みたいだ\n ナA + みたいだ\n N + みたいだ\n \n\n[JLPT レベル]\n N4\n\n[備考]\n 「〜ようだ 」よりもカジュアルで、友達や家族、親しい人と話す時に使う。\n\n\n例文\n・あそこで事故があったみたいです。\n・どうやら、車とバイクがぶつかったみたいです。\n・彼はお腹が空いているみたいです。\n・頭が痛いし、体も暑いし、熱があるみたいだ。\n・トムさんは最近、忙しいみたいだ。\n・電源ボタンを押しても、つかないし、壊れているみたいだ。\n・二人は最近話さないし、別れたみたいだ。\n・トムさん、すごく嬉しそうだし、試験に合格したみたいだね。\n・広場に有名人がいるみたいで、たくさん人が集まっている。\n・あのレストランは人がたくさん並んでいるし、人気があるみたいです。\n・彼は昨日あまり寝てないみたいだ。\n\n\n類似文型\n【JLPT N4】文法・例文：〜ようだ（推量）\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/07/22/jlptn4-grammar-mitaida/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "みたいな",
        "みたいな",
        "・〜みたいな / 〜みたいに（例示）",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜みたいな / 〜みたいに （例示）   】\n\n\n[意味]\n 具体的な例を挙げる時に使う\n \n\n[英訳]\n Used to explain something by showing an example.\n \n\n[接続]\n V（普通形） + みたいな / みたいに\n N + みたいな / みたいに\n\n[JLPT レベル]\n N4\n\n\n例文\nトムさんみたいに日本語が上手に話せるようになりたいなあ。\nI want to be able to speak Japanese like Tom.\n彼みたいに怠け者で、いつも親に頼ってばかりいる人にはなりたくない。\nI don't want to be a lazy person like him, always relying on my parents.\n将来はマレーシアみたいな物価の安い国に住みたい。\nI want to live in a low-living-cost country like Malaysia in the future.\nグレープフルーツや、レモンみたいな酸っぱい果物が苦手です。\nI don't like sour fruits such as grapefruit and lemon.\nハンバーガーやピザみたいな高カロリーの物ばかり食べていると太るよ。\nYou will get fat if you eat only high-calorie foods like hamburgers and pizza.\n私は大阪みたいな賑やかな街が好きです。\nI like bustling cities like Osaka.\n将来は先生みたいな優しくて、面白い人になりたいです。\nIn the future, I want to be a kind and interesting person like my teacher.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/07/22/jlptn4-grammar-mitaina/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "みたいに",
        "みたいに",
        "・〜みたいな / 〜みたいに（例示）",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜みたいな / 〜みたいに （例示）   】\n\n\n[意味]\n 具体的な例を挙げる時に使う\n \n\n[英訳]\n Used to explain something by showing an example.\n \n\n[接続]\n V（普通形） + みたいな / みたいに\n N + みたいな / みたいに\n\n[JLPT レベル]\n N4\n\n\n例文\nトムさんみたいに日本語が上手に話せるようになりたいなあ。\nI want to be able to speak Japanese like Tom.\n彼みたいに怠け者で、いつも親に頼ってばかりいる人にはなりたくない。\nI don't want to be a lazy person like him, always relying on my parents.\n将来はマレーシアみたいな物価の安い国に住みたい。\nI want to live in a low-living-cost country like Malaysia in the future.\nグレープフルーツや、レモンみたいな酸っぱい果物が苦手です。\nI don't like sour fruits such as grapefruit and lemon.\nハンバーガーやピザみたいな高カロリーの物ばかり食べていると太るよ。\nYou will get fat if you eat only high-calorie foods like hamburgers and pizza.\n私は大阪みたいな賑やかな街が好きです。\nI like bustling cities like Osaka.\n将来は先生みたいな優しくて、面白い人になりたいです。\nIn the future, I want to be a kind and interesting person like my teacher.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/07/22/jlptn4-grammar-mitaina/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "やすい",
        "やすい",
        "・〜やすい",
        "adj-i",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜やすい   】\n\n\n[意味]\n 〜するのが簡単だ / 簡単に〜という状態になる\n\n[英訳]\n easy to do\n\n[接続]\n V（ます形）ます + やすい\n\n[JLPT レベル]\n N4\n\n\n例文\n「山」という漢字は実際の山と形が似ているため、覚えやすいです。\nThe kanji “山” is easy to memorize because it is similar in shape to a real mountain.\nスプーンとフォークを使ったほうが食べやすいですよ。\nIt's easier to eat with a spoon and fork.\n野菜を食べやすい大きさに切ってください。\nPlease cut the vegetables into bite-sized pieces.\nこのスマホは機能がシンプルなので使いやすいです。\nThis phone is easy to use because of its simple functions.\n田中先生の説明は他の先生よりもわかりやすいです。\nTeacher Tanaka’s explanations are easier to understand than those of other teachers.\nこっちの道を通ったほうが渋滞もないので、行きやすいですよ。\nIt's easier to go this way because there is no traffic jam.\n山田さんはやさしくて、おしゃべりなのでとても話しやすいです。\nMr. Yamada is kind and talkative, so he is very easy to talk to.\nこの教科書は漢字の上にルビがあるからわかりやすいです。\nThis textbook is easy to understand because of the ruby above the kanji.\nこの入れ物は割れやすいので、注意してください。\nPlease be careful with this container, it is easy to break.\nこの街は静かで、車も少ないから住みやすいです。\nThis town is quiet and there are few cars, so it is easy to live here.\nこの問題は間違えやすいから注意してください。\nThis question is easy to get wrong, so please be careful.\nこのカメラでは初心者でも使いやすいですよ。\nThis camera is easy to use, even for beginners.\nインドネシア語は日本人にとって勉強しやすい外国語らしい。\nI heard that Indonesian is an easy foreign language for Japanese to learn.\n働きやすい環境で仕事がしたいね。\nI want to work in a comfortable environment.\n私は他の人よりも太りやすい。\nI gain weight more easily than other people.\n年をとると、髪も抜けやすくなります。\nAs people get older, their hair tends to fall out.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/05/02/jlptn4-grammar-yasui/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ようだ",
        "ようだ",
        "・〜ようだ（推量）",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ようだ（推量）   】\n\n\n[意味]\n \n 五感を使って話し手が感じたこと、推量したことを言う表現\n \n\n[英訳]\n It seems like\n\n[接続]\n V（普通形） + ようです\n イA（普通形）+ ようです\n ナA（普通形）+ ようです　※\u001cナAな + ようです\n N（普通形）+ ようです    ※Nの + ようです\n\n[JLPT レベル]\n N4\n\n\n例文\n彼はお腹が空いているようです。\nHe seems to be hungry.\nさっき雨が降ったようです。\nIt seems to have rained a while ago.\nあの二人は喧嘩したようです。\nIt seems that they had a fight.\nトムさんは試験に合格したようです。\nTom seems to have passed his exam.\n事故があったようで、たくさんの人が集まっている。\nThere seems to have been an accident, and there are a lot of people here.\nあのレストランは人がたくさん並んでいるし、人気があるようです。\nThere are a lot of people lined up at that restaurant, and it seems to be very popular.\nどうやら 彼は留守のようです。\nIt looks like he's not home.\n彼は昨日あまり寝てないようです。\nHe doesn't seem to have slept much last night.\nこの家からいい匂いがする。どうやら晩ご飯はカレーのようだ。\nThere's a nice smell coming from this house.  It looks like curry for dinner.\n（福袋を触って）中に傘が入っているようだ。\nTouching the lucky bag：There seems to be an umbrella inside.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/13/jlptn4-grammar-youda/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ようと思う",
        "ようとおもう",
        "・〜ようと思う",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ようと思う   】\n\n\n[意味]\n 話し手が発話の時点で考えた計画や決心を述べる時に使う表現。\n\n[英訳]\n This sentence pattern is used to talk about the speaker’s determinations or plans.\n\n[接続]\n V（意向形） + と思う\n\n[JLPT レベル]\n N4\n\n\n例文\nこれから、図書館で勉強しようと思います。\nI'm going to study at the library.\n今日は給料日なので、欲しかったゲームを買おうと思います。\nToday is payday, so I'm going to buy the game I want.\n早く仕事が終わったので、ちょっと飲みに行こうと思います。\nI finished work early, so I'm going out for a drink.\n風邪を引いたので、今日はゆっくり家で休もうと思います。\nI caught a cold, so I'm going to take it easy at home today.\n明日は早く起きようと思います。\nI'm going to wake up early tomorrow.\n忘れ物をしたので、一度家に帰ろうと思います。\nI forgot something, so I'm going to go home once.\n夏休みはアルバイトを増やそうと思います。\nI'm going to get another part time job during the summer vacation.\nお年玉でゲームを買おうと思います。\nI'm going to buy a video game with my Otoshidama (New Year's allowance).\n授業が簡単すぎるので、もう少し難しい本を買って自分で勉強しようと思います。\nI'm going to buy some more difficult books and study by myself because the classes are too easy.\n来年はJLPTを受けようと思います。\nI'm going to take the JLPT next year.\n体調が悪いので、今日はもう帰ろうと思います。\nI'm not feeling well, so I think I'll go home now.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/12/31/jlptn4-grammar-youtoomou/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ようと思っている",
        "ようとおもっている",
        "・〜ようと思っている",
        "v1",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ようと思っている   】\n\n\n[意味]\n 話し手の意思や計画を伝える時に使う表現。\n\n[英訳]\n Used to talk about the speaker’s determinations or plans.\n\n[接続]\n V（意向形） + と思っています\n\n[JLPT レベル]\n N4\n\n[備考]\n 「〜ようと思っている」はその前から話し手がずっと考えていたこと。「〜ようと思う」は発話の時点で考えたこと。\n\n\n例文\n大学を卒業したら、国へ帰ろうと思っています。\nI'm planning to go back to my country after I graduate from university.\n夏休みは国へ帰ろうと思っています。\nI am planning to go back to my country during the summer vacation.\n将来はマレーシアに住もうと思っています。\nI'm planning to live in Malaysia in the future.\nお年玉で新しいゲームを買おうと思っています。\nI am going to buy a new game with my Otoshidama(New Year's gift).\n来年は本を１００冊読もうと思っています。\nI am planning to read 100 books next year.\n来年はJLPT N2を受けようと思っています。\nI am planning to take the JLPT N2 exam next year.\n３０歳になるまでに、結婚しようと思っています。\nI am planning to get married before I turn 30.\n今度の記念日に彼女にプロポーズしようと思っています。\nI'm planning to propose to my girlfriend on our upcoming anniversary.\n国へ帰る前に、一度相撲の試合を見に行こうと思っています。\nI'm planning to see a sumo match before I go back to my country.\n将来は医者になろうと思っています。\nI'm planning to become a doctor in the future.\n彼女の誕生日に鞄を買おうと思っています。\nI'm planning to buy my girlfriend a bag for her birthday.\n来週、クリスマスパーティーをしようと思っています。\nI’m going to have a Christmas party next week.\nこの本を買おうと思っているんですが、どうですか。\nI'm thinking of buying this book, what do you think?\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/12/31/jlptn4-grammar-youtoomotteiru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ような",
        "ような",
        "・〜ような / 〜ように （例示）",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ような / 〜ように （例示）   】\n\n\n[意味]\n 具体的な例を挙げる時に使う\n \n\n[英訳]\n Used to explain something by showing an example.\n \n\n[接続]\n V（普通形） + ような / ように\n Nの + ような / ように\n\n[JLPT レベル]\n N4\n\n[備考]\n 話し言葉では「〜みたいな」を使う\n\n\n例文\n彼が持っているような鞄が欲しいです。\nI want a bag like the one he has.\n彼はまだ小学生なのに、大人が読むような難しい本を読んでいます。\nHe is still in elementary school, but he reads difficult books like adults.\n私は大阪のような賑やかな街が好きです。\nI like bustling cities like Osaka.\n私は父のような真面目な人になりたいです。\nI want to be a diligent person like my father.\nチョコレートのような甘い物が大好きです。\nI love sweets like chocolate.\n彼のように日本語が上手に話せるようになりたい。\nI want to be able to speak Japanese as well as he does.\n子供でもわかるように、わかりやすい言葉で説明してください。\nPlease explain in a simple manner that even a child can understand.\n一度でいいから、王様のような暮らしがしてみたい。\nI want to live like a king, just once.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/07/21/jlptn4-grammar-youna/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ように",
        "ように",
        "・〜ように（目標・期待）",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ように（目標・期待）   】\n\n\n[意味]\n 目標を実現させるために〜する\n\n[英訳]\n so that / in order to\n\n[接続]\n V（辞書形） + ように\n V（ナイ形）+ ように\nVは無意志動詞（見える、聞こえる、わかる、なおる、可能動詞など）\n\n[JLPT レベル]\n N4\n\n\n例文\nJLPTに合格できるように、勉強した単語や文法を復習します。\nI will review the vocabulary and grammar I have studied so that I can pass the JLPT.\nホワイトボードの字がよく見えるように、前の席に座ります。\nI will sit by the front so that I can see the characters on the whiteboard clearly.\n日本語を上手に話せるように、毎日シャドーイングをしています。\nI do shadowing every day so that I can speak Japanese well.\n日本語初級者でもわかるように、やさしい日本語で話します。\nI will speak in easy Japanese so that even beginners can understand.\n来年、海外旅行ができるように、お金を少しずつ貯めています。\nI am saving up money so that I can travel abroad next year.\n友達が日本に留学できるように、祈っています。\nI am praying for my friends to be able to study in Japan.\n子供でも飲めるように、少しコーヒーを甘くしました。\nI made the coffee a little sweeter so that even children can drink it.\n日本語で漫画が読めるように、毎日日本語を勉強しています。\nI study Japanese everyday so that I can read manga in Japanese.\n太らないように、甘いものは食べないことにしています。\nI try not to eat sweets so that I don't gain weight.\n明日、寝坊しないように、今日は早く寝ます。\nI'm going to bed early today so that I won't oversleep tomorrow.\n誰にも気がつかれないように、こっそりと家を出た。\nI left the house secretly so that no one would notice.\n忘れないように、メモをしておきます。\nI will make a memo so that I won't forget.\n地震が起きても慌てないように、家族との連絡方法を決めておきます。\nIn order to avoid panic in the event of an earthquake, we will decide in advance how to contact our families.\n明日、遠足でしょ？ ちゃんと、起きられるように今夜は早く寝なさい。\nTomorrow is a field trip, right? Go to bed early tonight so that you can wake up properly.\nおじいちゃんに聞こえるように、大きな声で話します。\nI will speak loudly so that my grandpa can hear me.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/09/25/jlptn4-grammar-yooni/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ようにしている",
        "ようにしている",
        "・〜ようにしている",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ようにしている   】\n\n\n[意味]\n 習慣的にしていることをいう表現\n\n[接続]\n V（辞書形 / ナイ形）+ ようにしている\n\n[JLPT レベル]\n N4\n\n\n例文\n・健康のためにできるだけ毎日運動するようにしています。\n・健康のためにタバコは吸わないようにしています。\n・毎日１１時には寝るようにしています。\n・朝ごはんはきちんと食べるようにしています。\n・今、一人暮らしをしていますが、毎日、野菜を食べるようにしています。\n・すみません、お酒は飲まないようにしているんです。\n・毎日１０分はシャドーイングの練習をするようにしています。\n・就職してからは、毎日新聞を読むようにしています。\n・授業で習ったことは、家に帰ってからすぐに復習するようにしています。\n・１週間に１回、国の家族に連絡するようにしています。\n・メッセージをもらったら、できるだけ早く返すようにしています。\n・１日１回は彼女にメッセージを送るようにしています。\n・私は１日に１回は妻に\"I love you\"と言うようにしています。\n・電車では空いていても、座らないようにしています。\n・習った言葉は、できるだけその日に使うようにしています。\n・ドラマやアニメは見ませんが、ニュースは毎日見るようにしています。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/08/26/jlptn4-graammar-younishiteiru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ようにする",
        "ようにする",
        "・〜ようにする",
        "vs",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ようにする   】\n\n\n[意味]\n 〜ように 努力する/ 頑張って〜する\n 話し手が意識的に頑張って〜すると決めて、それを述べる時に使う。\n\n[英訳]\n to make a conscious effort to do something\n\n[接続]\n V（辞書形）+ ようにする\n V（ない形）+ ようにする\n\n[JLPT レベル]\n N4\n\n\n例文\n・体がことが心配になって来たので、しばらくタバコは吸わないようにします。\n医者：健康のために野菜もしっかり食べてください。\n 患者：わかりました。じゃあ、今日から毎日野菜を食べるようにします。\nA：このまま痩せなければ、入院することになりますよ！\n B：じゃあ、明日から毎朝１０分ジョギングするようにします。\n B：それから、スナックやカロリーの高いものは食べないようにします。\nA：トムさんは今日も遅刻ですよ！いつになったら時間通りに来れるんですか？\n B：すみません、明日からは絶対に遅刻しないようにします。\nA：もっとナチュラルな日本語を話したいなら、毎日シャドーイングの練習をしてみたらどうですか？\n B：じゃあ、今日から毎日朝と夜にシャドーイングの練習をするようにします。\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2020/01/09/jlptn4-grammar-younisuru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "ようになる",
        "ようになる",
        "・〜ようになる",
        "v5",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜ようになる / 〜なくなる   】\n\n\n[意味]\n 以前は〜じゃないが、今は〜である。\n 状況や能力の変化を表す。\n●誤用例\n 最近、運動不足なので、太るようになりました。\n\n[英訳]\n become such that\n\n[接続]\n V（辞書形）+ ようになる\n V（ない形）なくなる\n\n[JLPT レベル]\n N4\n\n\n例文\n1. 〜ようになる・最近、納豆が食べられるようになりました。\n・うちの子は一人で自転車に乗れるようになりました。\n・日本語で書かれた小説が読めるようになりました。\n・日本に来た時は全然、映画の日本語が聞き取れませんでしたが、今では少し聞き取れるようになりました。\n・１年前は全然漢字が書けなかったけど、今はたくさん書けるようになりました。\n・以前よりも給料がだいぶ増えたので、一人で暮らしていけるようになりました。\n・出張がキャンセルになったので、今夜の飲み会に参加できるようになりました。\n・日本語の勉強を始めてから、日本語で漫画を読んだり、アニメを見たりするようになりました。\n・大学生になってから自分で弁当を作るようになりました。\n2. 〜なくなる・学校を卒業してからは、もう英語を勉強していないので、話せなくなりました。\n・子供の時はよく外で遊びましたが、大人になってからは遊ばなくなりました。\n・友達と大げんかして以来、一度も話さなくなりました。\n・子供の頃、よく家族と旅行したのに、今はあまりしなくなりました。\n・インフルエンザになって、学校に行けなくなりました。\n・交通事故で怪我をして、私は歩けなくなりました。\n・年をとったせいで、小さな文字が見えなくなってきました。\n・終電を逃して、帰れなくなりました。\n・社会人になってからはゲームをしなくなりました。\n・大学生になってからはテレビを見なくなりました。\n\n\n類似文型\n〜ようになる\n〜なくなる\n【教案】みんなの日本語初級２：第３６課\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/06/23/jlptn4-grammar-youninaru-nakunaru/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "予定だ",
        "よていだ",
        "・〜予定だ",
        "",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：〜予定だ   】\n\n\n[意味]\n 〜するつもりだ\nすでに決まったスケジュールを言うときに使われる。話し手の意志が含まれていないことにも使える。\n\n[英訳]\n  Used to say that an action/plan is scheduled to happen or be done.\n\n[接続]\n V（辞書形） + 予定だ\n N + の予定だ\n\n[JLPT レベル]\n N4\n\n\n例文\n1. V + 予定です明日は友達とモールへ行く予定です。\nI'm going to the mall tomorrow with my friends.\n夏休みは国へ帰る予定です。\nI’m planing to go back to my country during the summer vacation.\n大学を卒業したら、国へ帰る予定です。\nI’m planing to go back to my country after I graduate from college.\n僕たちは来年、結婚する予定です。\nWe are planning to get married next year.\n来週、家族が日本へ来る予定です。\nMy family will be coming to Japan next week.\n来年から１年、世界一周する予定です。\nWe are planning to go around the world for a year from next year.\n明日は朝９時の飛行機に乗る予定です。\nI am going to take a 9:00 a.m. flight tomorrow.\n\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2019/12/30/jlptn4-grammar-yoteida/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ],
    [
        "らしい",
        "らしい",
        "・〜らしい（典型）",
        "adj-i",
        0,
        [
            {
                "type": "structured-content",
                "content": [
                    "【   【JLPT N4】文法・例文：Nらしい（典型）   】\n\n\n[意味]\n 「そのものの典型的な性質を持っている」ということを表す表現。\n\n[英訳]\n Acts just like~ is / typical of ~ / an epitome of\n\n[接続]\n N + らしい\n N + らしく\n\n[JLPT レベル]\n N4\n\n\n例文\n・子供は子供らしく、外で遊んだいいがいい。\n・今日は夏らしい日だ。\n・今日は少し暖かく、春らしい天気となるでしょう。\n・私は今まで、病気らしい病気をしたことがありません。\n・田中さんは本当に男らしいですね。\n・この絵はいかにも鈴木さんらしい絵ですね。\n・だんだん秋らしい景色になってきましたね。\n・遊んでばかりいないで、もっと学生らしく勉強しなさい。\n・この会社にいても自分らしく働くことは難しいから、自分の会社を作ろうを思っている。\n・彼はまだ入社１年目なのに、毎日、新入社員らしくない格好で会社へ来ている。\n・約束の時間の５分前には着いてるなんて、日本人らしいね。僕の国だったら、たいてい３０分は遅れるよ。\n\n\n類似文型\n中級を学ぼう-中級前期　第５課：わたしの町\n",
                    {
                        "tag": "a",
                        "href": "https://nihongokyoshi-net.com/2018/06/22/jlptn4-grammar-rashii/",
                        "content": "nihongo kyoushi link"
                    }
                ]
            }
        ],
        0,
        "日本語NETーN4文法"
    ]
]
